Repository: pawal/ipv6.cool
Catalog: translations/*/main.po
Languages: sv

source: detail mail tls dane-rollover label
sv: DANE rollover scheme

source: detail mail tls dane-rollover tech table
sv: Mail server (MX)|DANE rollover scheme

source: detail mail tls dane-rollover verdict bad
sv: At least one of your mail server domains does *not* have an active DANE scheme for a reliable rollover of certificate keys.

source: detail mail tls dane-rollover verdict good
sv: All your mail server domains have an active DANE scheme for a reliable rollover of certificate keys.

source: detail mail tls dane-valid exp
sv: We check if the DANE fingerprints presented by your mail server domains are valid for your mail server certificates. DANE allows you to publish information about your mail server certificates in a special DNS record, called TLSA record. Sending mail servers can check the authenticity of your certificates not only through the certificate authority but also through the TLSA records. A sending mail server can also use the TLSA record as a signal to only connect via STARTTLS (and not unencrypted). When the DANE fingerprint of a receiving mail server is checked by the sending mail server, an active attacker who is able to manipulate the mail trafic cannot strip STARTTLS encryption.

source: detail mail tls dane-valid label
sv: DANE validity

source: detail mail tls dane-valid tech table
sv: Mail server (MX)|DANE TLSA record valid

source: detail mail tls dane-valid verdict bad
sv: At least one DANE fingerprint on your mail server domains is *not* valid for its mail server certificate. Either someone manipulated the response from the name server, or the mail server domains have a serious DANE configuration error. The latter makes your domain unreachable for any sending mail server that checks DANE fingerprints. You should contact your mail provider as soon as possible.

source: detail mail tls dane-valid verdict good
sv: The DANE fingerprints on your mail server domains are valid for all your mail server certificates.

source: detail mail tls fs-params exp
sv: We check if the public parameters used in Diffie-Hellman key exchange by your receiving mail servers (MX) are secure. The security of elliptic curve Diffie-Hellman (ECDHE) ephemeral key exchange depends on the used elliptic curve. We check if the bit-length of the used elliptic curves is a least 224 bits. Currently we are not able to check the elliptic curve name. The security of Diffie-Hellman Ephemeral (DHE) key exchange depends on the lengths of the public and secret keys used within the chosen finite field group. We test if your DHE public key material uses one of the predefined finite field groups that are specified in [RFC 7919](https://tools.ietf.org/html/rfc7919). Self-generated groups are 'Insufficient'. The larger key sizes required for the use of DHE come with a performance penalty. Carefully evaluate and use ECDHE instead of DHE if you can. Besides ECDHE and DHE, RSA can be used for key exchange. However, it is at risk of becoming insufficiently secure (current status 'phase out'). The RSA public parameters are tested in the subtest 'Public key of certificate'. Note that RSA is considered as 'good' for certificate verification. See ['IT Security Guidelines for Transport Layer Security (TLS)'](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) from NCSC-NL, guideline B5-1 and table 9 for ECDHE, and guideline B6-1 and table 10 for DHE (in English). --- **Elliptic curve for ECDHE** * Good: `secp384r1`, `secp256r1`, `x448`, and `x25519` * Phase out: `secp224r1` * Insufficient: Other curves **Finite field group for DHE** Sufficient: * [ffdhe4096](https://raw.githubusercontent.com/internetstandards/dhe_groups/master/ffdhe4096.pem) (RFC 7919) sha256 checksum: `64852d6890ff9e62eecd1ee89c72af9af244dfef5b853bcedea3dfd7aade22b3` * [ffdhe3072](https://raw.githubusercontent.com/internetstandards/dhe_groups/master/ffdhe3072.pem) (RFC 7919) sha256 checksum: `c410cc9c4fd85d2c109f7ebe5930ca5304a52927c0ebcb1a11c5cf6b2386bbab` Phase out: * [ffdhe2048](https://raw.githubusercontent.com/internetstandards/dhe_groups/master/ffdhe2048.pem) (RFC 7919) sha256 checksum: `9ba6429597aeed2d8617a7705b56e96d044f64b07971659382e426675105654b` Insufficient: Other groups

source: detail mail tls fs-params label
sv: Key exchange parameters

source: detail mail tls fs-params tech table
sv: Mail server (MX)|Affected parameters|Security level

source: detail mail tls fs-params verdict bad
sv: At least one of your mail servers supports *insufficiently* secure parameters for Diffie-Hellman key exchange.

source: detail mail tls fs-params verdict good
sv: All your mail servers support secure parameters for Diffie-Hellman key exchange.

source: detail mail tls fs-params verdict na
sv: This subtest is not applicable as your mail servers do not support Diffie-Hellman key exchange. Note that RSA is an alternative for key exchange, but has the *phase out* status.

source: detail mail tls fs-params verdict phase-out
sv: At least one of your mail servers supports parameters for Diffie-Hellman key exchange that have a *phase out* status, because they are known to be fragile and are at risk of of becoming *insufficiently* secure.

source: detail mail tls kex-hash-func exp
sv: We check if your receiving mail servers (MX) support secure hash functions to create the digital signature during key exchange. A receiving mail server uses a digital signature during the key exchange to prove ownership of the secret key corresponding to the certificate. The mail server creates this digital signature by signing the output of a hash function. See ['IT Security Guidelines for Transport Layer Security (TLS)'](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) from NCSC-NL, table 5. *Requirement level: Recommended* --- **SHA2 support for signatures** * Good: Yes (SHA-256, SHA-384 or SHA-512 supported) * Phase out: No (SHA-256, SHA-384 of SHA-512 *not* supported)

source: detail mail tls kex-hash-func label
sv: Hash function for key exchange

source: detail mail tls kex-hash-func tech table
sv: Mail server (MX)|SHA2 support for signatures

source: detail mail tls kex-hash-func verdict good
sv: All your mail servers support secure hash functions for key exchange.

source: detail mail tls kex-hash-func verdict other
sv: We were unable to determine the hash function used by at least one of your mail servers. This could be because the cipher combination used has no signature for certificate verification (e.g it uses RSA key exchange or is anonymous i.e. `anon`).

source: detail mail tls kex-hash-func verdict phase-out
sv: At least one of your mail servers does *not* support a secure hash function for key exchange. You should *phase out* this setting deliberately, because it is at risk of becoming *insufficiently* secure in the future.

source: detail mail tls ocsp-stapling exp
sv: OUTDATED TEXT; TEST NOT USED We check if your receiving mail server supports the [TLS Certificate Status extension](https://www.ietf.org/rfc/rfc6961.txt) aka OCSP stapling. With OCSP stapling your mail server can provide OCSP responses itself which removes the need for the TLS client to verify the validity of the mail server certificate directly with the certificate supplier, and thus avoids exposing potentially privacy sensitive data about the client to the certificate supplier. It also does not require connectivity between client and certificate supplier and is faster. See ['IT Security Guidelines for Transport Layer Security (TLS)'](https://www.ncsc.nl/english/current-topics/factsheets/it-security-guidelines-for-transport-layer-security-tls.html), guideline B9-1 (in English). When connecting to your mail server we use the TLS Certificate Status extension to request OCSP data be included in the server response. If your mail server includes OCSP data in the response we then verify that the OCSP data is signed by a known certificate authority.

source: detail mail tls ocsp-stapling label
sv: OUTDATED TEXT; TEST NOT USED OCSP stapling

source: detail mail tls ocsp-stapling tech table
sv: OUTDATED TEXT; TEST NOT USED Mail server (MX)|OCSP stapling

source: detail mail tls ocsp-stapling verdict bad
sv: OUTDATED TEXT; TEST NOT USED At least one of your mail servers supports OCSP stapling but responds with invalid data

source: detail mail tls ocsp-stapling verdict good
sv: OUTDATED TEXT; TEST NOT USED Your mail servers support OCSP stapling.

source: detail mail tls ocsp-stapling verdict ok
sv: OUTDATED TEXT; TEST NOT USED At least one of your mail servers does not support OCSP stapling.

source: detail mail tls renegotiation-client exp
sv: We check if a sending mail server can initiate a renegotiation with your receiving mail servers (MX). Allowing sending mail servers to initiate renegotiation is generally not necessary and opens a receiving mail server to DoS attacks inside a TLS connection. An attacker can perform similar DoS-attacks without client-initiated renegotiation by opening many parallel TLS connections, but these are easier to detect and defend against using standard mitigations. Note that client-initiated renegotiation impacts availability and not confidentiality. See ['IT Security Guidelines for Transport Layer Security (TLS) v2.0'](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) from NCSC-NL, guideline B8-1 and table 13 (in English). *Requirement level: Recommended*

source: detail mail tls renegotiation-client label
sv: Client-initiated renegotiation

source: detail mail tls renegotiation-client tech table
sv: Mail server (MX)|Client-initiated renegotiation

source: detail mail tls renegotiation-client verdict bad
sv: At least one of your mail servers allows for client-initiated renegotiation, which is *not* secure.

source: detail mail tls renegotiation-client verdict good
sv: All your mail servers do not allow for client-initiated renegotiation.

source: detail mail tls renegotiation-secure exp
sv: We check if your mail servers (MX) support secure renegotiaton. Older versions of TLS (prior to TLS 1.3) allow forcing a new handshake. This so-called renegotiation was insecure in its original design. The standard was repaired and a safer renegotiation mechanism was added. The old version is since called insecure renegotiation and should be disabled. See ['IT Security Guidelines for Transport Layer Security (TLS)'](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) from NCSC-NL, guideline B8-1 and table 12 (in English).

source: detail mail tls renegotiation-secure label
sv: Secure renegotiation

source: detail mail tls renegotiation-secure tech table
sv: Mail server (MX)|Secure renegotiation

source: detail mail tls renegotiation-secure verdict bad
sv: At least one of your mail servers supports insecure renegotiation, which is obviously *not* secure.

source: detail mail tls renegotiation-secure verdict good
sv: All your mail servers support secure renegotiation.

source: detail mail tls starttls-exists exp
sv: We check if your receiving mail servers (MX) support STARTTLS. If so, we also check in the below subtests whether STARTTLS is configured sufficiently secure. In case no mail server is defined, we give a notification and we execute other subtests of the mail test that are still relevant. Note: for performance reasons at most ten mail servers over either IPv6 or IPv4 are checked in the STARTTLS test category.

source: detail mail tls starttls-exists label
sv: STARTTLS available

source: detail mail tls starttls-exists tech table
sv: Mail server (MX)|STARTTLS

source: detail mail tls starttls-exists verdict bad
sv: At least one of your mail servers does *not* offer STARTTLS.

source: detail mail tls starttls-exists verdict good
sv: All your mail servers offer STARTTLS.

source: detail mail tls starttls-exists verdict other
sv: At least one of your mail servers is unreachable.

source: detail mail tls starttls-exists verdict other-2
sv: No mail servers are set on your domain. We advise you to use "Null MX" (RFC 7505) for domains without mail servers. The test does not fall back to A/AAAA records for mail servers in case of absence of an MX record.

source: detail mail tls version exp
sv: We check if your mail servers (MX) support secure TLS versions only. A mail server may support more than one TLS version. Note: Quite some mail servers only support older TLS versions. If the sending and receiving mail server both do not support the same TLS version, they will usually fall back to unencrypted mail transport. Because of that it could be advisable to keep supporting TLS versions with a 'phase out' status for a while. Make an informed decision based on log data on when to disable these 'phase out' TLS versions. See ['IT Security Guidelines for Transport Layer Security (TLS) v2.0'](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) from NCSC-NL, guideline B1-1 and table 1 (in English). --- * Good: TLS 1.3 and 1.2 * Phase out: TLS 1.1 and 1.0 * Insufficient: SSL 3.0, 2.0 and 1.0

source: detail mail tls version label
sv: TLS version

source: detail mail tls version tech table
sv: Mail server (MX)|Affected TLS versions|Status

source: detail mail tls version verdict bad
sv: At least one of your mail servers supports one or more *insufficiently* secure TLS versions.

source: detail mail tls version verdict good
sv: All your mail servers support secure TLS versions only.

source: detail mail tls version verdict phase-out
sv: At least one of your mail servers supports one or more TLS versions that should be *phased out* deliberately, because they are known to be fragile and at risk of becoming *insufficiently* secure.

source: detail mail tls zero-rtt exp
sv: We check if your mail servers (MX) support Zero Round Trip Time Resumption (0-RTT). 0-RTT is an option in TLS 1.3 that transports application data during the first handshake message. 0-RTT does not provide protection against replay attacks at the TLS layer and therefore should be disabled. Although the risk can be mitigated by not allowing 0-RTT for non-idempotent requests, such a configuration is often not trivial, reliant on application logic and thus error prone. If your mail servers do not support TLS 1.3, the test is not applicable. For mail servers that support TLS 1.3, the STARTTLS command is issued and a TLS session is initiated. The amount of [early data](https://www.openssl.org/docs/manmaster/man3/SSL_get_max_early_data.html) support [indicated](https://tools.ietf.org/html/rfc8446#section-4.2.10) by the mail server is checked. When more than zero, a second connection is made re-using the TLS session details of the first connection but sending the EHLO command _before_ the TLS handshake but _after_ the STARTTLS command (i.e. no round trips (0-RTT) needed before application data to the server). If the TLS handshake is completed and the mail server responds, then the mail server is considered to support 0-RTT. See ['IT Security Guidelines for Transport Layer Security (TLS)'](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) from NCSC-NL, guideline B9-1 and table 14 (in English).

source: detail mail tls zero-rtt label
sv: 0-RTT

source: detail mail tls zero-rtt tech table
sv: Mail server (MX)|0-RTT

source: detail mail tls zero-rtt verdict bad
sv: At least one of your mail servers supports 0-RTT, which is *not* secure.

source: detail mail tls zero-rtt verdict good
sv: None of your mail servers support 0-RTT.

source: detail mail tls zero-rtt verdict na
sv: This subtest is not applicable as your mail servers do not support TLS 1.3.

source: detail tech data bogus
sv: bogus

source: detail tech data good
sv: good

source: detail tech data insecure
sv: insecure

source: detail tech data insufficient
sv: insufficient

source: detail tech data no
sv: no

source: detail tech data not-applicable
sv: not applicable

source: detail tech data not-tested
sv: not tested

source: detail tech data phase-out
sv: phase out

source: detail tech data secure
sv: secure

source: detail tech data sufficient
sv: sufficient

source: detail tech data yes
sv: yes

source: detail verdict could-not-test
sv: Test error. Please try again later.

source: detail verdict not-tested
sv: This test did not run, because either a parent test that this test depends on gave a negative result ('fail') or not enough information was available to run this test.

source: detail web appsecpriv http-csp exp
sv: We check if your web server provides an HTTP header for `Content-Security-Policy` (CSP). CSP protects a website against cross-site scripting (XSS) attacks. By whitelisting sources of approved content with CSP, you prevent browsers from loading malicious content of attackers. Currently we do not evaluate the effectivenes of the CSP configuration. However we suggest to: - use the HTTP header for `Content-Security-Policy-Report-Only` to experiment with CSP policies by monitoring their effects without enforcing these effects; - use `frame-ancestors` to prevent the webpage from being loaded into a frame; - set a policy with `default-src` in order to have a fallback for other resource types when they do not have their own policy; - sparingly use `unsafe-inline` and `data:`, because they enable XSS attacks; - use `https://` when a URL is used to refer to a source. Also see ['Web application guidelines from NCSC-NL'](https://www.ncsc.nl/actueel/whitepapers/ict-beveiligingsrichtlijnen-voor-webapplicaties.html), guideline U/PW.03 (in Dutch). *Requirement level: Optional*

source: detail web appsecpriv http-csp label
sv: Content-Security-Policy existence

source: detail web appsecpriv http-csp tech table
sv: Web server IP address|CSP value

source: detail web appsecpriv http-csp verdict bad
sv: Your web server does *not* offer Content-Security-Policy (CSP).

source: detail web appsecpriv http-csp verdict good
sv: Your web server offers Content-Security-Policy (CSP).

source: detail web appsecpriv http-referrer-policy exp
sv: We check if your web server provides an HTTP header for `Referrer-Policy`. With this HTTP header you let browsers know which referrer information, that is sent in the `Referer` header, should be part of the website request. The `Referer` header contains the address of the previous web page from which the visitor followed a link to the requested page. The information in the `Referer` header is mostly used for analytics and logging. However there can be privacy and security risks. The information could be used e.g. for user tracking and the information could leak to third parties who eavesdrop the connection. With the HTTP header for `Referrer-Policy` you can mitigate these risks. Currently we do *not* evaluate the effectivenes of the configured `Referrer-Policy` value. However we suggest to make an informed decision, with privacy and security risks in mind, on using one of the policy values from the first two categories below. *Recommended policy values:* 1. No sensitive data to third parties - `no-referrer` - `same-origin` 2. Sensitive data to third parties only via secure connections (HTTPS) - `strict-origin` - `strict-origin-when-cross-origin` *Not recommended policy values:* 3. Sensitive data to third parties possibly via insecure connections (HTTP) - `no-referrer-when-downgrade` (browsers' default policy) - `origin-when-cross-origin` - `origin` - `unsafe-url` *Requirement level: Recommended*

source: detail web appsecpriv http-referrer-policy label
sv: Referrer-Policy existence

source: detail web appsecpriv http-referrer-policy tech table
sv: Web server IP address|Referrer-Policy value

source: detail web appsecpriv http-referrer-policy verdict bad
sv: Your web server does *not* offer Referrer-Policy.

source: detail web appsecpriv http-referrer-policy verdict good
sv: Your web server offers Referrer-Policy.

source: detail web appsecpriv http-x-content-type exp
sv: We check if your web server provides an HTTP header for `X-Content-Type`. With this HTTP header you let web browsers know that they must not do 'MIME type sniffing' and always follow the `Content-Type` as declared by your web server. The only valid value for this HTTP header is `nosniff`. When enabled, a browser will block requests for `style` and `script` when they do not have a corresponding `Content-Type` (i.e. `text/css` or a 'JavaScript MIME type' like `application/javascript`). 'MIME type sniffing' is a technique where the browser scans the content of a file to detect the format of a file regardless of the declared `Content-Type` by the web server. This technique is vulnerable to the so-called 'MIME confusion attack' in which the attacker manipulates the content of a file in a way that it is treated by the browser as a different `Content-Type`, like an executable. *Requirement level: Recommended*

source: detail web appsecpriv http-x-content-type label
sv: X-Content-Type-Options

source: detail web appsecpriv http-x-content-type tech table
sv: Web server IP address|X-Content-Type value

source: detail web appsecpriv http-x-content-type verdict bad
sv: Your web server does *not* offer X-Content-Type-Options.

source: detail web appsecpriv http-x-content-type verdict good
sv: Your web server offers X-Content-Type-Options.

source: detail web appsecpriv http-x-frame exp
sv: We check if your web server provides an HTTP header for `X-Frame-Options` that has a sufficiently secure configuration. With this HTTP header you let web browsers know whether you want to allow your website to be framed or not. Prevention of framing defends visitors against attacks like clickjacking. We consider the following values to be sufficiently secure: * `DENY` (framing not allowed); * `SAMEORIGIN` (only framing by your own website allowed); or * `ALLOW-FROM https://example.nl/` (only allow specific websites to frame your website). `Content-Security-Policy` (CSP) offers similar protection and much more for visitors with modern web browsers. However `X-Frame-Options` could still protect visitors of older web browsers that do not support CSP. Furthermore `X-Frame-Options` could offer valueable protection for all visitors when CSP is not (properly) configured for the website concerned. Also see ['Web application guidelines from NCSC-NL'](https://www.ncsc.nl/actueel/whitepapers/ict-beveiligingsrichtlijnen-voor-webapplicaties.html), guideline U/PW.03 (in Dutch). *Requirement level: Recommended*

source: detail web appsecpriv http-x-frame label
sv: X-Frame-Options

source: detail web appsecpriv http-x-frame tech table
sv: Web server IP address|X-Frame-Options value

source: detail web appsecpriv http-x-frame verdict bad
sv: Your web server does *not* offer securely configured X-Frame-Options.

source: detail web appsecpriv http-x-frame verdict good
sv: Your web server offers securely configured X-Frame-Options.
