Repository: pawal/ipv6.cool
Catalog: translations/*/main.po
Languages: sv

source: faqs content
sv: ## Tests * [About the website test](/test-site/) * [About the email test](/test-mail/) * [About the connection test](/test-connection/) ## Standards * [Modern address (IPv6)](/faqs/ipv6/) * [Domain signature (DNSSEC)](/faqs/dnssec/) * [Secure website connection (HTTPS)](/faqs/https/) * [Application security options (Security options)](/faqs/appsecpriv/) * [Protection against email phishing (DMARC, DKIM and SPF)](/faqs/mailauth/) * [Secure email transport (STARTTLS and DANE)](/faqs/starttls/) ## Test report * [Explanation of test report](/faqs/report/)

source: faqs dnssec content
sv: ## Why Below you will find some links to descriptions of some known incidents that DNSSEC probably could have prevented. * ["Cache-poisoning attack snares top Brazilian bank"](https://www.theregister.co.uk/2009/04/22/bandesco_cache_poisoning_attack/) * ["Eircom reveals ‘cache poisoning’ attack by hacker led to outages"](https://www.siliconrepublic.com/enterprise/eircom-reveals-cache-poisoning-attack-by-hacker-led-to-outages) * ["DNS cache poisonings foist malware attacks on Brazilians"](https://www.theregister.co.uk/2011/11/07/brazilian_dns_cache_poisoing_attacks/) * ["Probable Cache Poisoning of Mail Handling Domains"](http://www.cert.org/blogs/certcc/post.cfm?EntryID=206) * ["Neither Snow Nor Rain Nor MITM... An Empirical Analysis of Email Delivery Security"](http://dl.acm.org/citation.cfm?id=2815695) Below follows a quotation from the last mentioned research publication: > Mail security, like that of many other protocols, is intrinsically tangled with the security of DNS resolution. Rather than target the SMTP protocol, an active network attacker can spoof the DNS records of a destination mail server to redirect SMTP connections to a server under the attacker’s control. [...] We find evidence that 178,439 out of 8,860,639(2.01%) publicly accessible DNS servers provided invalid IPs or MX records for one or more of these domains. ## Adoption statistics * [.nl stats and data](http://stats.sidnlabs.nl/#/dnssec) by SIDN Labs * [DNSSEC Validation Measurement](https://stats.labs.apnic.net/dnssec) by APNIC * [DNSSEC Deployment Report](http://dnssec-deployment.icann.org/dctld/) ## Further information * [ISOC's Deploy360 on DNSSEC](http://www.internetsociety.org/deploy360/dnssec/) * [SIDN about DNSSEC](https://www.sidn.nl/a/internet-security/dnssec?language_id=2) * [DNSSEC.net](http://www.dnssec.net/) * [DNSSEC/TLSA Validator](https://www.dnssec-validator.cz/) * [Wikipedia on DNSSEC](https://en.wikipedia.org/wiki/Domain_Name_System_Security_Extensions) ## Specifications * [RFC 4033: DNS Security Introduction and Requirements](https://datatracker.ietf.org/doc/rfc4033) * [RFC 4034: Resource Records for the DNS Security Extensions](https://datatracker.ietf.org/doc/rfc4034) * [RFC 4035: Protocol Modifications for the DNS Security Extensions](https://datatracker.ietf.org/doc/rfc4035)

source: faqs dnssec title
sv: Domain signature (DNSSEC)

source: faqs https content
sv: ## Why * [Does my site need HTTPS?](https://doesmysiteneedhttps.com/) * ["Why HTTPS for Everything?"](https://https.cio.gov/everything/) by CIO.gov * ["Still think you don't need HTTPS?"](https://scotthelme.co.uk/still-think-you-dont-need-https/)by Scott Helme ## Adoption statistics * ["Percentage of Web Pages Loaded by Firefox Using HTTPS"](https://letsencrypt.org/de/stats/#percent-pageloads) * ["HTTPS Usage" by Google](https://www.google.com/transparencyreport/https/metrics/?hl=en) ## Further information * [Factsheet "HTTPS could be a lot more secure"](https://english.ncsc.nl/publications/factsheets/2019/juni/01/factsheet-https-could-be-a-lot-more-secure) by NCSC-NL * ["ICT securitity guidelines for TLS v2.0"](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) by NCSC-NL * ["ICT security guidelines for web applications"](https://www.ncsc.nl/documenten/publicaties/2019/mei/01/ict-beveiligingsrichtlijnen-voor-webapplicaties) by NCSC-NL (in Dutch) * [Mozilla SSL Configuration Generator](https://mozilla.github.io/server-side-tls/ssl-config-generator/) * [Bettercrypto.org](https://bettercrypto.org) * [How HTTPS works](https://howhttps.works/) ## Specifications * [RFC 2818: HTTP Over TLS](https://datatracker.ietf.org/doc/rfc2818) * [RFC 8446: The Transport Layer Security (TLS) Protocol Version 1.3](https://datatracker.ietf.org/doc/rfc8446/) * [RFC 5246: The Transport Layer Security (TLS) Protocol, Version 1.2](https://datatracker.ietf.org/doc/rfc5246) * [RFC 6797: HTTP Strict Transport Security (HSTS)](https://datatracker.ietf.org/doc/rfc6797) * [RFC 6698: The DNS-Based Authentication of Named Entities (DANE) Transport Layer Security (TLS) Protocol: TLSA](https://tools.ietf.org/html/rfc6698)

source: faqs https title
sv: Secure website connection (HTTPS)

source: faqs ipv6 content
sv: ## Why * ["Three reasons why ISPs should deploy IPv6 now"](https://internetnz.nz/blog/three-reasons-why-isps-should-deploy-ipv6-now) by George Michaelson (APNIC) * ["Making a Strong Case for IPv6"](http://www.baselinemag.com/networking/making-a-strong-case-for-ipv6.html) by John Curran (ARIN) * ["IPv6: It's time to get on board"](https://code.facebook.com/posts/1192894270727351/ipv6-it-s-time-to-get-on-board/) by Paul Saab (Facebook) ## Adoption statistics * [APNIC IPv6 Measurements](https://stats.labs.apnic.net/ipv6/) * [World IPv6 Launch](http://www.worldipv6launch.org/measurements/) * [Akamai IPv6 adoption](https://www.akamai.com/us/en/about/our-thinking/state-of-the-internet-report/state-of-the-internet-ipv6-adoption-visualization.jsp) * [Google IPv6 statistics](https://www.google.com/intl/en/ipv6/statistics.html) * [Cisco IPv6 statistics](http://6lab.cisco.com/stats/) * [IPv6 RIPEness information](https://ipv6ripeness.ripe.net/) ## Further information * [ISOC's Deploy360 on IPv6](http://www.internetsociety.org/deploy360/ipv6/) * [IPv6 Info Centre at RIPE](https://www.ripe.net/publications/ipv6-info-centre/) * [Wikipedia on IPv6](https://en.wikipedia.org/wiki/IPv6) * ["Policy Issues for Receiving Email in a World with IPv6 Hosts" from M³AAWG](https://www.m3aawg.org/sites/default/files/document/M3AAWG_Inbound_IPv6_Policy_Issues-2014-09.pdf) ## Specifications * [RFC 2460: Internet Protocol, Version 6 (IPv6), Specification](https://datatracker.ietf.org/doc/rfc2460/)

source: faqs ipv6 title
sv: Modern address (IPv6)

source: faqs mailauth content
sv: ## Why * ["Why you should be doing DMARC"](https://governmenttechnology.blog.gov.uk/2016/10/04/why-you-should-be-doing-dmarc/) by GOV.uk * ["Why is DMARC important?"](https://dmarc.org/wiki/FAQ#Why_is_DMARC_important.3F) by DMARC.org ## Adoption statistics * [".nl stats and data > Mail"](https://stats.sidnlabs.nl/#/mail) * ["DMARC Deployment"](https://eggert.org/meter/dmarc) * ["Who Is Using DMARC?"](https://dmarc.org/who-is-using-dmarc/) ## Further information * [How-to on DMARC, DKIM and SPF](https://github.com/internetstandards/toolbox-wiki) by Dutch Internet Standards Platform * [FAQ on DMARC.org](https://dmarc.org/FAQ/) * ["A tip for mailing list operators to interoperate with DMARC to avoid failures"](https://blogs.msdn.microsoft.com/tzink/2017/03/22/a-tip-for-mailing-list-operators-to-interoperate-with-dmarc-to-avoid-failures/) * ["How we moved microsoft.com to a p=quarantine DMARC record"](https://blogs.msdn.microsoft.com/tzink/2016/09/27/how-we-moved-microsoft-com-to-a-pquarantine-dmarc-record/) * ["How to send DMARC compliant email on behalf of others"](https://space.dmarcian.com/how-to-send-dmarc-compliant-email-on-behalf-of-others/) * DMARC report tooling: [DMARC Analyzer](https://www.dmarcanalyzer.com/), [dmarcian](https://dmarcian.com/), [MailReport](http://www.mailreport.eu/), [URIports.com](https://www.uriports.com/), [tools on DMARC.org](https://dmarc.org/resources/products-and-services/), [tools on Github](https://github.com/search?p=2&q=dmarc+report) * Research report ["Designing an open source DMARC aggregation tool"](https://www.os3.nl/_media/2015-2016/courses/rp2/p13_report.pdf) * [DMARC.org](https://dmarc.org/), [OpenSPF.org](http://www.openspf.org/) and [DKIM Core](http://dkimcore.org/) ## Specifications * [RFC 7489: Domain-based Message Authentication, Reporting, and Conformance (DMARC)](https://datatracker.ietf.org/doc/rfc7489/) * [RFC 6376: DomainKeys Identified Mail (DKIM) Signatures](https://datatracker.ietf.org/doc/rfc6376) * [RFC 7208: Sender Policy Framework (SPF) for Authorizing Use of Domains in Email, Version 1](https://datatracker.ietf.org/doc/rfc7208/)

source: faqs mailauth title
sv: Protection against email phishing (DMARC, DKIM and SPF)

source: faqs report score content
sv: ### What norm is Internet.nl using? Internet.nl checks the (correct) implementation of modern Internet Standards that improve the reliability of online services. A score of 100% means that a website, e-mail service or internet connection complies with our test norm. This norm is based on the Internet Standards on the 'comply-or-explain' list of the Dutch Standardisation Forum, on the security advices of the Dutch NCSC and on the relevant RFC's of IETF. ### Will the norm be adjusted? The test norm of Internet.nl will be adjusted over time as the state of the art changes. Adjustments will be announced through news items on our website. New subtests will (usually) not impact the score after their initial release and have the 'RECOMMENDED' or 'OPTIONAL' status. In the future these new items could get the 'REQUIRED' status and weigh in the overall score. ### How does the score relate to security? Although many of the tested Intern Standards contribute to a higher security level of your website, mail service or internet connection, a 100% score does not mean that an online service is fully secure. There are more aspects which are important for the security of your online services. But these are out of scope for Internet.nl. Please keep in mind that Internet.nl is intended as a standards compliance test and not as a security test. ### How is the test report structured? - Internet.nl contains **three main tests**, i.e. for websites, mail services and internet connections. - These main tests consist of **test categories** that include **subtests**. For example, one of the main tests is the website test which contains a test category on HTTPS that has a subtest on HSTS. - A subtest can have one of the following three requirement levels (in conformance with [RFC 2119](https://tools.ietf.org/html/rfc2119)): - REQUIRED ('must') - RECOMMENDED ('should') - OPTIONAL ('may') - When a subtest is either 'RECOMMENDED' or 'OPTIONAL', this is mentioned in the test explanation. ### How is the percentage score calculated? - Each main test is resulting in an overall percentage score. - Every test category of a main test weighs more or less evenly in the overall percentage score. So if a main test consists of four test categories, the maximum score for every test category is 25%. - Only the subtests with the status 'REQUIRED' weigh in the score of a test category and in the overall percentage score. - Websites with a perfect score of 100% will be added to the [Hall of Fame](/halloffame/).

source: faqs report score title
sv: Norm and score

source: faqs report subtest bad
sv: Fail on REQUIRED subtest ⇒ null score

source: faqs report subtest good
sv: Pass on REQUIRED, RECOMMENDED or OPTIONAL subtest ⇒ first: full score / latter two: no score impact

source: faqs report subtest info
sv: Fail on OPTIONAL subtest ⇒ no score impact

source: faqs report subtest not-tested
sv: Not tested, because already failed related parent subtest ⇒ null score

source: faqs report subtest partly-tested
sv: Some servers passed subtest, but not all servers could be tested ⇒ null score

source: faqs report subtest title
sv: Icons per subtest

source: faqs report subtest warning
sv: Fail on RECOMMENDED subtest ⇒ no score impact

source: faqs report test bad
sv: Failed at least one REQUIRED subtest ⇒ no full score in test category

source: faqs report test error
sv: Execution error for at least one subtest ⇒ no result in test category

source: faqs report test good
sv: Passed all subtests ⇒ full score in test category

source: faqs report test info
sv: Failed at least one OPTIONAL subtest ⇒ full score in test category

source: faqs report test title
sv: Icons per test category

source: faqs report test warning
sv: Failed at least one RECOMMENDED subtest ⇒ full score in test category

source: faqs report title
sv: Explanation of test report

source: faqs starttls content
sv: ## Why * ["Opportunistic Security: Some Protection Most of the Time"](https://tools.ietf.org/html/rfc7435) by V. Dukhovni * ["New e-mail security protocols mandatory within government"](https://www.sidnlabs.nl/a/weblog/new-e-mail-security-protocols-mandatory-within-government?language_id=2) by Marco Davids (SIDNlabs) * ["The sad state of SMTP encryption"](https://blog.filippo.io/the-sad-state-of-smtp-encryption/) by Filippo Valsorda ## Adoption statistics * [DANE trend graphs](http://stats.dnssec-tools.org/#graphs) * [DANE statistics](https://github.com/baknu/DANE-for-SMTP/wiki/4.-Adoption-statistics) * [Google's statistics on STARTTLS](https://www.google.com/transparencyreport/saferemail/?hl=en) ## Further information * [How-to on 'DANE for SMTP'](https://github.com/internetstandards/toolbox-wiki) by Dutch Internet Standards Platform * [Wiki over 'DANE for SMTP'](https://github.com/baknu/DANE-for-SMTP/wiki) * [Factsheet "Secure the connections of mail servers"](https://english.ncsc.nl/publications/factsheets/2019/juni/01/factsheet-secure-the-connections-of-mail-servers) by NCSC-NL * ["ICT securitity guidelines for TLS v2.0"](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) by NCSC-NL * [BSI TR-03108 Sicherer E-Mail-Transport](https://www.bsi.bund.de/DE/Publikationen/TechnischeRichtlinien/tr03108/index_htm.html) by German Federal Office for Information Security * [Special Publication 1800-6: “Domain Name Systems-Based Electronic Mail Security”](https://nccoe.nist.gov/projects/building-blocks/secured-email) by NIST ## Specifications and guidelines * [RFC 3207: SMTP Service Extension for Secure SMTP over Transport Layer Security](https://datatracker.ietf.org/doc/rfc3207) * [RFC 7672: SMTP Security via Opportunistic DNS-Based Authentication of Named Entities (DANE) Transport Layer Security (TLS)](https://datatracker.ietf.org/doc/rfc7672) * [RFC 7671: The DNS-Based Authentication of Named Entities (DANE) Protocol: Updates and Operational Guidance](https://datatracker.ietf.org/doc/rfc7671)

source: faqs starttls title
sv: Secure email transport (STARTTLS and DANE)

source: faqs title
sv: Knowledge base

source: halloffame champions menu
sv: Champions!

source: halloffame champions subtitle
sv: 100% in website *and* email test

source: halloffame champions text
sv: The {{count}} domains below score 100% in both the website test and the email test.

source: halloffame champions title
sv: Hall of Fame - Champions!

source: halloffame mail badge
sv: Badge with text: 100% score in email test

source: halloffame mail menu
sv: Email

source: halloffame mail subtitle
sv: 100% in email test

source: halloffame mail text
sv: The {{count}} domains below score 100% in the email test.

source: halloffame mail title
sv: Hall of Fame - Email

source: halloffame web badge
sv: Badge with text: 100% score in website test

source: halloffame web menu
sv: Websites

source: halloffame web subtitle
sv: 100% in website test

source: halloffame web text
sv: The {{count}} domains below score 100% in the website test.

source: halloffame web title
sv: Hall of Fame - Websites

source: home pagetitle
sv: Test for modern Internet Standards like IPv6, DNSSEC, HTTPS, DMARC, STARTTLS and DANE.

source: home stats connection
sv: connection tests

source: home stats connection-items
sv: connections

source: home stats header
sv: Statistics

source: home stats mail
sv: email tests

source: home stats mail-items
sv: mail servers

source: home stats notpassed
sv: 0-99% score:

source: home stats passed
sv: 100% score:

source: home stats website
sv: website tests

source: home stats website-items
sv: websites

source: home teaser
sv: Modern Internet Standards provide for more reliability and further growth of the Internet. Are you using them?

source: mail pagetitle
sv: Email test:

source: mail title
sv: Email test: {{prettyaddr}}

source: mail tweetmessage
sv: The%20mail%20server%20at%20{{report.domain}}%20scores%20{{score}}%25%20in%20the%20email%20test%20of%20%40Internet_nl%3A

source: page gotocontents
sv: Go to the content

source: page gotofooter
sv: Go to the footer

source: page gotomainmenu
sv: Go to the main menu

source: page metadescription
sv: Test for modern Internet Standards like IPv6, DNSSEC, HTTPS, TLS, HSTS, DMARC, DKIM, SPF, STARTTLS and DANE.

source: page metakeywords
sv: IPv6, DNSSEC, HTTPS, HSTS, TLS, DMARC, DKIM, SPF, STARTTLS, DANE, test, test tool, check, validation, Internet, Internet Standards, open standards, modern standards, security, internet security, mail, email security, website, website security, internet connection, secure connection, email authentication, encryption, ciphers, cipher suites, PKI, SSL certificate, TLS certificate, website certificaat, Internet Standards Platform

source: page sitedescription
sv: Is your Internet up-to-date?

source: page sitetitle
sv: Internet.nl

source: page404 content
sv: The page you are looking for is not on this server. [Go to the home page](/)

source: page404 title
sv: Page not found!
