Repository: pawal/ipv6.cool
Catalog: translations/*/main.po
Languages: sv

source: privacy content
sv: # Privacy statement *Revised 9th of December 2019* The Dutch Internet Standards Platform respects your privacy. With this privacy statement, we would like to inform you about what personal data we collect when you use our website and other services on Internet.nl and how we process this data. Your rights are covered by the applicable laws, mainly the [European General Data Protection Regulation (GDPR)](https://eur-lex.europa.eu/legal-content/EN/TXT/HTML/?uri=CELEX:32016R0679) and the [Dutch Telecommunications Act](http://wetten.overheid.nl/BWBR0009950/). ## What data will be collected? ### Website (Internet.nl) #### Application When you are using Internet.nl we collect the following data which is necessary for the functioning of the website. - IP address of your client (remote host) which made the request to our web server: - When a connection test is performed, only your *anonymized* IP address and *anonymized* reverse name are stored in the application database and shown in the connection test report that is available for the user via a permalink. - In any other cases your (full or anonymized) IP address is *not* stored in the application database. - Domain names that you provided to perform email or website tests: - Domain names are stored in the application database. They will be shown in the test reports available for the user via a permalink and could be shown in the Hall of Fame. - Only the domain name is stored, but *not* the 'local-part' (i.e. the part before @example.nl) of a provided email address. #### Server logs For debugging connection issues and for solving (security) incidents we keep the below data in our web server logs. - IP address of the client (remote host) which made the request to our web server; - The time that the request was received; - User-Agent HTTP request header that the client browser reported about itself; - Status code that the server sends back to the client; - Size of the object returned to the client; - Error message with regard to processing the request. #### User analytics We put analytical cookies on your device to analyze the use of our website. We run Matomo (formerly Piwik) on our own web server. Matomo is one of the most privacy-friendly analytical tools currently available. The statistics generated with these cookies are used only to improve our website. We collect the following data: - IP address (anonymized); - Very rough location of the user based on anonymized IP address; - Date and time; - Title of the page being viewed; - URL of the page being viewed; - URL of the page that was viewed prior to the current page; - Screen resolution; - Time in local timezone; - Files that were clicked and downloaded; - Link clicks to an outside domain; - Pages generation time; - Main Language of the browser; - User Agent of the browser. Because the impact of these analytical cookies on your privacy is very limited in light of the GDPR and Section 11.7a of the Dutch Telecommunication Act, you do not need to give your consent for this. If you do not want us to track your device, we recommend that you turn on the *Do Not Track* function in your browser. Matomo will not track users that use the Do Not Track function (see [this page](https://matomo.org/docs/privacy/#step-4-respect-donottrack-preference) on Matomo.org). For more information about Do Not Track and how to turn it on in your browser, see the website [All About Do Not Track](https://allaboutdnt.com/). ### Email (@internet.nl) When you send emails to [question@internet.nl](mailto:question@internet.nl) we collect the following data: - Email address used and other mail header data (like time); - Any other personal data that the sender put in the mail. ## What measures are in place to secure the collected data? ### Access and third parties Our services are running on servers, that are maintained by Prolocation B.V. and Open Netlabs / NLnet Labs. ECP is in charge of operating the mailbox. Collected data may be shared with other [members of the Internet Standards Platform](/about/) only to answer questions, to solve issues or to improve our services. No third party services are used (like external analytics tooling or web fonts). We do not in any way pass on personal data collected by us to third parties (i.e. outside the Internet Standards Platform), unless we are legally obliged to do so (for example, if the authorities with a legal basis request data from us). ### Technical measures We have implemented a.o. the following technical measures to secure your personal data: - Modern, secure standards are in place. We comply with our own tests. E.g. our web server offers an encrypted connection (HTTPS) and the domain is signed (DNSSEC); - Software on our servers is updated regularly; - Our engineers use strong authentication to access the servers. In case you find a vulnerability, despite of our efforts, please act in accordance with our [responsible disclosure](/disclosure/) policy. ### Anonymization - Application: The anonymization of the IP address of your client means that at least the last 16 bits of each IPv4 address and the last 96 bits of each IPv6 address are discarded and replaced with zero's before storing in the application database (e.g. visible is only 198.51.0.0 or 2001:db8::). Besides we anonymize the found reverse name by masking the first one or more labels. By anonymizing the IP address and reverse name we make sure that it is not possible to relate these directly to a person anymore, even not with the other associated data colllected. IP addresses belonging to web servers, mail servers or name servers will not be anonymized, because we consider this data to be public data which is published in DNS. The same goes for domain names; we also consider this to be public data. - User analytics: At least 16 bits for IPv4 and 80 bits for IPv6 are discarded and replaced with zero's before storing an IP address in our analytics tooling (e.g. visible is only 198.51.0.0 or 2001:db81:85a3::). ### Data retention period - Application: Because the anonymized visiting IP address and associated collected data can not be directly related to a person, we do not maintain a specific retention period for the data stored in our aplication database. - Server logs: Data collected in our server logs will be deleted after three calendar months. - User analytics: Individual visitor data (including the anonymized IP address) in our analytics tooling will be deleted after 90 days. - Email: Processing emails is a core activity of The Dutch Internet Standards Platform. Based on the [requirements](https://www.belastingdienst.nl/wps/wcm/connect/bldcontentnl/belastingdienst/zakelijk/ondernemen/administratie/administratie_opzetten/wat_hoort_er_allemaal_bij_uw_administratie) set by the Dutch Tax and Customs Administration, email correspondence will be deleted after seven years. ## Inspection, correction and deletion of data Pursuant to the European General Data Protection Regulation (GDPR), you have the right of access to your personal data upon request and, if necessary, to amend it or have it deleted. Please [contact us](/about/) in case you wish to do so. Because we keep your full IP address only temporarily in our server logs, you might need to supply us with additional information, such as about your device and browser as well as the date and time of your visit, for us to be able to honour your request. ## Update privacy statement We may change our privacy statement. We will announce this change on our website. Older versions of our privacy statement will be stored in our archive. Send us an email if you want to consult it.

source: probes auto-redirect
sv: You will be automatically redirected to the results page when all tests are finished.

source: probes no-javascript
sv: Check if the test results are available. If not, you will be redirected here instead.

source: probes no-javascript-connection
sv: JavaScript inactive. Please enable JavaScript in order to execute the test.

source: probes no-redirection
sv: Test error. Please try again later, or test another domain name.

source: probes test-finished
sv: Test finished! Results available...

source: probes test-running
sv: Running...

source: probes tests-description
sv: The items below are being tested.

source: probes tests-duration
sv: The duration of the test is between 5 and {{cache_ttl}} seconds.

source: results dated-presentation
sv: Dated result presentation. Please rerun the test.

source: results domain appsecpriv http-headers label
sv: HTTP security headers

source: results domain ipv6 web-server label
sv: Web server

source: results domain tls http-headers label
sv: HTTP headers

source: results domain tls https label
sv: HTTP

source: results domain tls tls label
sv: TLS

source: results domain-mail ipv6 name-servers label
sv: Name servers

source: results domain-mail tls certificate label
sv: Certificate

source: results domain-mail tls dane label
sv: DANE

source: results empty-argument-alt-text
sv: None

source: results explanation label
sv: Test explanation:

source: results further-testing connection content
sv: - ### IPv6: - [IPv6 test](http://ipv6-test.com/) - ### DNSSEC: - [DNSSEC resolver algorithm test](https://rootcanary.org/test.html) - ### HTTPS: - [SSL Client Test](https://www.ssllabs.com/ssltest/viewMyClient.html)

source: results further-testing connection label
sv: Further connection testing

source: results further-testing mail content
sv: - ### IPv6: - [IP6.nl](https://ip6.nl/) - ### DNSSEC: - [DNSViz](http://dnsviz.net/) - ### DMARC, DKIM and SPF : - [MECSA - EU Commission](https://mecsa.jrc.ec.europa.eu/) (also STARTTLS+DANE) - [DMARC Toolkit - GCA](https://dmarc.globalcyberalliance.org/) - [Mail-tester.com](https://www.mail-tester.com/) - ### STARTTLS and DANE: - [DANE SMTP Validator](https://dane.sys4.de/) - [HaveDane.net](https://havedane.net/)

source: results further-testing mail label
sv: Further email testing

source: results further-testing web content
sv: - ### IPv6: - [IP6.nl](https://ip6.nl/) - [NAT64 Check](https://nat64check.org/) - [IP address visibility](https://stat.ripe.net/widget/visibility) - ### DNSSEC: - [DNSViz](http://dnsviz.net/) - [Zonemaster](https://zonemaster.net/) - ### HTTPS: - [Observatory by Mozilla](https://observatory.mozilla.org/) - [SSLlabs](https://www.ssllabs.com/ssltest/) - ### Security options: - [CSP Evaluator](https://csp-evaluator.withgoogle.com/) - [Analyze your CSP](https://report-uri.com/home/analyse/)

source: results further-testing web label
sv: Further website testing

source: results mail auth dkim label
sv: DKIM

source: results mail auth dmarc label
sv: DMARC

source: results mail auth spf label
sv: SPF

source: results mail dnssec domain label
sv: Email address domain

source: results mail dnssec mail-servers label
sv: Mail server domain(s)

source: results mail ipv6 mail-servers label
sv: Mail server(s)

source: results mail tls starttls label
sv: TLS

source: results no-icon-detail close
sv: close

source: results no-icon-detail open
sv: open

source: results no-icon-status error
sv: Error

source: results no-icon-status failed
sv: Failed

source: results no-icon-status good-not-tested
sv: Partly passed, partly not testable

source: results no-icon-status info
sv: Information

source: results no-icon-status not-tested
sv: Not testable

source: results no-icon-status passed
sv: Passed

source: results no-icon-status warning
sv: Recommendation

source: results panel-button hide
sv: Hide details

source: results panel-button show
sv: Show details

source: results perfect-score
sv: Congratulations, your domain will be added to the **Hall of Fame** soon!

source: results permalink
sv: Permalink test result {{permadate|date:'(Y-m-d H:i T)'}}

source: results rerun-test
sv: Rerun the test

source: results retest-time
sv: Seconds until retest option:

source: results score-description
sv: The domain {{prettyaddr}} has a test score of {{score}}%.

source: results tech-details label
sv: Technical details:

source: results test direct
sv: Directly test:

source: results test email label
sv: Test another email

source: results test website label
sv: Test another website

source: results test-info
sv: Explanation of test report

source: results verdict label
sv: Verdict:

source: test connipv6 failed description
sv: Too bad! Your internet provider has *not* given you a modern internet address ([IPv6](/faqs/ipv6/)), or has not configured everything correctly. Therefore you are *not* able to reach other computers with modern adresses. Please ask your internet provider for full IPv6 connectivity.

source: test connipv6 failed summary
sv: Modern addresses *not* reachable (IPv6)

source: test connipv6 info description
sv: Too bad! Your internet provider has *not* given you a modern internet address ([IPv6](/faqs/ipv6/)), or has not configured everything correctly. Therefore you are *not* able to reach other computers with modern adresses. Please ask your internet provider for full IPv6 connectivity.

source: test connipv6 info summary
sv: Modern addresses *not* reachable (IPv6)

source: test connipv6 label
sv: Modern addresses reachable (IPv6)

source: test connipv6 passed description
sv: Well done! Your internet provider has provided you with a modern internet address ([IPv6](/faqs/ipv6/)). Therefore you can reach other computers with modern adresses.

source: test connipv6 passed summary
sv: Modern addresses reachable (IPv6)

source: test connipv6 title
sv: Modern addresses reachable?

source: test connipv6 warning description
sv: Too bad! Your internet provider has *not* given you a modern internet address ([IPv6](/faqs/ipv6/)), or has not configured everything correctly. Therefore you are *not* able to reach other computers with modern adresses. Please ask your internet provider for full IPv6 connectivity.

source: test connipv6 warning summary
sv: Modern addresses *not* reachable (IPv6)

source: test connresolver failed description
sv: Too bad! Domain signatures ([DNSSEC](/faqs/dnssec/)) are *not* validated for you. Therefore you are *not* protected against manipulated translation from signed domains into rogue IP addresses. Please ask your internet provider for DNSSEC validation and/or enable it on your own systems.

source: test connresolver failed summary
sv: Domain signatures *not* validated (DNSSEC)

source: test connresolver info description
sv: Too bad! Domain signatures ([DNSSEC](/faqs/dnssec/)) are *not* validated for you. Therefore you are *not* protected against manipulated translation from signed domains into rogue IP addresses. Please ask your internet provider for DNSSEC validation and/or enable it on your own systems.

source: test connresolver info summary
sv: Domain signatures *not* validated (DNSSEC)

source: test connresolver label
sv: Domain signature validation (DNSSEC)

source: test connresolver passed description
sv: Well done! Domain signatures ([DNSSEC](/faqs/dnssec/)) are validated for you. Therefore you are protected against false translation from signed domain names into rogue IP addresses.

source: test connresolver passed summary
sv: Domain signatures validated (DNSSEC)

source: test connresolver title
sv: Domain signatures validated?

source: test connresolver warning description
sv: Too bad! Domain signatures ([DNSSEC](/faqs/dnssec/)) are *not* validated for you. Therefore you are *not* protected against manipulated translation from signed domains into rogue IP addresses. Please ask your internet provider for DNSSEC validation and/or enable it on your own systems.

source: test connresolver warning summary
sv: Domain signatures *not* validated (DNSSEC)

source: test error summary
sv: *Error* during test execution!

source: test mailauth failed description
sv: Too bad! Your domain does *not* contain all authenticity marks against email forgery ([DMARC, DKIM and SPF](/faqs/mailauth/)). Therefore receivers are *not* able to reliably seperate phishing and spam emails abusing your domain in their sender address from your authentic emails. You should ask your mail provider to activate DMARC, DKIM and SPF.

source: test mailauth failed summary
sv: *Not* all authenticity marks against email phishing (DMARC, DKIM and SPF)

source: test mailauth info description
sv: Too bad! Your domain does *not* contain all authenticity marks against email forgery ([DMARC, DKIM and SPF](/faqs/mailauth/)). Therefore receivers are *not* able to reliably seperate phishing and spam emails abusing your domain in their sender address from your authentic emails. You should ask your mail provider to activate DMARC, DKIM and SPF.

source: test mailauth info summary
sv: *Not* all authenticity marks against email phishing (DMARC, DKIM and SPF)

source: test mailauth label
sv: Authenticity marks against phishing (DMARC, DKIM en SPF)

source: test mailauth passed description
sv: Well done! Your domain contains all authenticity marks against email forgery ([DMARC, DKIM and SPF](/faqs/mailauth/)). Therefore receivers are able to reliably seperate phishing and spam emails abusing your domain in their sender address, from your authentic emails.

source: test mailauth passed summary
sv: Authenticity marks against email phishing (DMARC, DKIM and SPF)

source: test mailauth title
sv: Authenticity marks against email phishing?

source: test mailauth warning description
sv: Too bad! Your domain does *not* contain all authenticity marks against email forgery ([DMARC, DKIM and SPF](/faqs/mailauth/)). Therefore receivers are *not* able to reliably seperate phishing and spam emails abusing your domain in their sender address from your authentic emails. You should ask your mail provider to activate DMARC, DKIM and SPF.

source: test mailauth warning summary
sv: *Not* all authenticity marks against email phishing (DMARC, DKIM and SPF)

source: test maildnssec failed description
sv: Too bad! Some or all of your email address and mail server domains are not signed with a valid signature ([DNSSEC](/faqs/dnssec/)). Therefore senders with enabled domain signature validation, are not able to reliably query the IP address of your receiving mail server(s). An attacker could secretely manipulate the IP address and divert e-mails addressed to you to his/her own mail server. You should ask your name server operator and/or your mail provider to enable DNSSEC.

source: test maildnssec failed summary
sv: *Not* all domain names signed (DNSSEC)

source: test maildnssec info description
sv: Too bad! Some or all of your email address and mail server domains are not signed with a valid signature ([DNSSEC](/faqs/dnssec/)). Therefore senders with enabled domain signature validation, are not able to reliably query the IP address of your receiving mail server(s). An attacker could secretely manipulate the IP address and divert e-mails addressed to you to his/her own mail server. You should ask your name server operator and/or your mail provider to enable DNSSEC.

source: test maildnssec info summary
sv: *Not* all domain names signed (DNSSEC)

source: test maildnssec label
sv: Signed domain names (DNSSEC)

source: test maildnssec passed description
sv: Well done! Your email address domain and your mail server domain(s) are signed with a valid signature ([DNSSEC](/faqs/dnssec/)). Therefore senders with enabled domain signature validation, are able to reliably query the IP address of your receiving mail server(s).

source: test maildnssec passed summary
sv: All domain names signed (DNSSEC)

source: test maildnssec title
sv: Domain names signed?

source: test maildnssec warning description
sv: Too bad! Some or all of your email address and mail server domains are not signed with a valid signature ([DNSSEC](/faqs/dnssec/)). Therefore senders with enabled domain signature validation, are not able to reliably query the IP address of your receiving mail server(s). An attacker could secretely manipulate the IP address and divert e-mails addressed to you to his/her own mail server. You should ask your name server operator and/or your mail provider to enable DNSSEC.

source: test maildnssec warning summary
sv: *Not* all domain names signed (DNSSEC)

source: test mailipv6 failed description
sv: Too bad! Your mail server can not be reached by senders using modern addresses ([IPv6](/faqs/ipv6/)), or improvement is possible. Therefore your mail server is not part of the modern Internet yet. You should ask your email provider to fully enable IPv6.

source: test mailipv6 failed summary
sv: *Not* reachable via modern internet address, or improvement possible (IPv6)

source: test mailipv6 info description
sv: Too bad! Your mail server can not be reached by senders using modern addresses ([IPv6](/faqs/ipv6/)), or improvement is possible. Therefore your mail server is not part of the modern Internet yet. You should ask your email provider to fully enable IPv6.

source: test mailipv6 info summary
sv: *Not* reachable via modern internet address, or improvement possible (IPv6)

source: test mailipv6 label
sv: Modern address (IPv6)

source: test mailipv6 passed description
sv: Well done! Your mail server can be reached by senders using modern addresses ([IPv6](/faqs/ipv6/)), making it fully part of the modern Internet.

source: test mailipv6 passed summary
sv: Reachable via modern internet address (IPv6)

source: test mailipv6 title
sv: Reachable via modern internet address?

source: test mailipv6 warning description
sv: Too bad! Your mail server can not be reached by senders using modern addresses ([IPv6](/faqs/ipv6/)), or improvement is possible. Therefore your mail server is not part of the modern Internet yet. You should ask your email provider to fully enable IPv6.

source: test mailipv6 warning summary
sv: *Not* reachable via modern internet address, or improvement possible (IPv6)

source: test mailtls failed description
sv: Too bad! Sending mail servers that support secure email transport ([STARTTLS and DANE](/faqs/starttls/)) can establish *no* or an *insufficiently* secure connection with your receiving mail server(s). Passive and/or active attackers will therefore be able to read emails in transit to you. You should ask your mail provider to enable STARTTLS and DANE, and configure it securely.

source: test mailtls failed summary
sv: Mail server connection *not* or insufficiently secured (STARTTLS and DANE)

source: test mailtls info description
sv: Too bad! Sending mail servers that support secure email transport ([STARTTLS and DANE](/faqs/starttls/)) can establish *no* or an *insufficiently* secure connection with your receiving mail server(s). Passive and/or active attackers will therefore be able to read emails in transit to you. You should ask your mail provider to enable STARTTLS and DANE, and configure it securely.

source: test mailtls info summary
sv: Mail server connection *not* or insufficiently secured (STARTTLS and DANE)

source: test mailtls label
sv: Secure mail server connection (STARTTLS and DANE)

source: test mailtls passed description
sv: Well done! Sending mail servers supporting secure email transport ([STARTTLS and DANE](/faqs/starttls/)) can establish a secure connection with your receiving mail server(s). STARTTLS prevents passive attackers from reading emails in transit to you. DANE protects against active attackers stripping STARTTLS encryption by manipulating the mail traffic.

source: test mailtls passed summary
sv: Mail server connection sufficiently secured (STARTTLS and DANE)

source: test mailtls title
sv: Secure mail server connection?
