Repository: pawal/ipv6.cool
Catalog: translations/*/main.po
Languages: sv

source: about contact
sv: ## Contact Internet Standards Platform c/o ECP Overgoo 13 PO box 262 2260AG Leidschendam The Netherlands CoC number: 27169301 ### Email [question@internet.nl](mailto:question@internet.nl) [PGP public key](/static/question@internet.nl_0x45028563.asc) Fingerprint: ACB7 8829 4C7E 12BA E922 8C60 D894 E15F 4502 8563 Expiration date: 5th of March 2023

source: about content
sv: # About Internet.nl ## What is Internet.nl? Internet.nl helps you to check whether your internet is up to date. Do your [website](/test-site/), [email](/test-mail/) and [internet connection](/test-connection/) use **modern and reliable Internet Standards**? And if they don't, what can you do about it? ## Who is behind Internet.nl? The test tool Internet.nl is an initiative of the Dutch **Internet Standards Platform**. The aim of the platform is to jointly increase the use of modern Internet standards to make **the Internet more accessible, safer and more reliable for everyone**. The platform is a collaboration between parties from the Internet community and the Dutch government. The following parties are currently participating in the platform: - [DHPA](https://dhpa.nl/) - [ECP](https://ecp.nl/) - [Dutch Standardisation Forum](https://forumstandaardisatie.nl/) - [Internet Society international](https://internetsociety.org/) - [Internet Society Nederlands chapter](https://isoc.nl/) - [ISPConnect](https://ispconnect.nl/) - [Ministry of Economic Affairs and Climate Policy](https://www.government.nl/ministries/ministry-of-economic-affairs-and-climate-policy) - [NCSC-NL](https://ncsc.nl/) - [NLnet](https://nlnet.nl/) - [NLnet Labs](https://nlnetlabs.nl/) - [RIPE NCC](https://ripe.net/) - [SIDN](https://sidn.nl/) - [SURFnet](https://surfnet.nl/) - [VvR](https://www.verenigingvanregistrars.nl/) ECP provides for the administrative home of the platform. The domain name Internet.nl is provided to the platform by the Netherlands chapter of the Internet Society. [Open Netlabs](https://opennetlabs.nl/) / NLnet Labs is responsible for the technical implementation of the Internet.nl website. ## What are Internet Standards? In order to exchange data between computers around the world, we need international agreements on how computers talk to one another. The digital "plugs and sockets" that link everything together, so to speak. These agreements are called Internet Standards or internet protocols. An example is SMTP, a well-known protocol for sending email. This technical core of the internet is unvisible and unknown to most users. However it is crucial for a working internet today and in the future. ## Why is it important to be up to date? The original internet standards date from the 70s and 80s, when the number of internet users was small. Nowadays, there are more than three billion users worldwide! And these people use the internet more and more for transactions that are privacy-sensitive and costly. The old standards cannot meet this scale nor the modern safety requirements. For instance, criminals are abusing the SMTP standard to spoof the sender address of an email. This means that we have to start using new, smarter standards that keep our internet reliable. The good news is that these modern Internet Standards are available. ## Are the Netherlands taking the lead in using modern Internet Standards? Unfortunately, that is not the case. Even in a modern country like the Netherlands (that became the first internet connected European country in 1988) we use too many outdated standards that fall short of reliability. Not using these modern standards is a risk for the individual internet user, but also for the Dutch economy and for the world at large. Therefore, please help improving the internet and make sure that you use modern Internet Standards. ## Who should act on modern Internet Standards? Our access, hosting and email providers should take care of implementing modern internet standards and setting them correctly. Do the test results show any shortcomings? Then please send a message about this to your provider(s). If you use your own connection, webserver or mailserver, you have to take care of the correct settings yourself. ## Why don’t you address the access, hosting and email providers directly? We do. Still it is important that internet users are aware themselves and send out signals to their provider(s) as well. This may come as a surprise, but in a modern country like the Netherlands we still use many standards that are outdated and lack reliability. Therefore please help us to improve the internet together, and demand modern Internet Standards.

source: base about
sv: About Internet.nl

source: base blogs
sv: Blogs

source: base contact
sv: Contact

source: base copyright
sv: Copyright

source: base disclosure
sv: Responsible disclosure

source: base faqs
sv: Knowledge base

source: base followtwitter
sv: Follow us on Twitter

source: base halloffame
sv: Hall of Fame

source: base halloffame champions
sv: Hall of Fame - Champions!

source: base halloffame lead
sv: {{count}} domains with double 100% Latest entry: {{latest|date:'d-m-Y'}}

source: base halloffame link
sv: To Hall of Fame - Champions!

source: base halloffame mail
sv: Hall of Fame - Email

source: base halloffame web
sv: Hall of Fame - Websites

source: base home
sv: Home

source: base info
sv: Internet.nl is an initiative of the Internet community and the Dutch government.

source: base news
sv: News

source: base newslink
sv: To the news overview

source: base partners
sv: Partners

source: base privacy
sv: Privacy statement

source: base test connection explain
sv: ## What is tested? After you start the connection test, we will check if your currently used internet connection offers support for the modern Internet Standards below. * [IPv6](/faqs/ipv6/): are websites with modern internet addresses reachable for you? * [DNSSEC](/faqs/dnssec/): are domain signatures validated for you? ## Test report? After the test is finished, you are directed to a test report. The report contains an overall percentage score and results per test section and per subtest. For more information see ["Explanation of test report"](/faqs/report/). ## How to improve? You can use this test report to improve your internet connection. Usually contacting your internet provider on this will be the best next step. In the communication with your internet provider you can use the permalink (i.e. the URL) of the test report. ## Test your connection

source: base test connection label
sv: Test your connection

source: base test connection text
sv: Modern addresses reachable? Domain signatures validated?

source: base test connection title
sv: About the connection test

source: base test explain
sv: About the test

source: base test mail explain
sv: ## What is tested? After you enter a domain name of an email service, we will test if the email service offers support for the modern Internet Standards below. * [IPv6](/faqs/ipv6/): reachable via modern internet address? * [DNSSEC](/faqs/dnssec/): domain names signed? * [DMARC, DKIM and SPF](/faqs/mailauth/): authenticity marks against email phishing? * [STARTTLS and DANE](/faqs/starttls): secure mail server connection? Note: some standards are even relevant if there are no mail servers configured for your domain. ## Test report? After the test is finished, you are directed to a test report. The report contains an overall percentage score and results per test section and per subtest. For more information see ["Explanation of test report"](/faqs/report/). ## How to improve? You can use this test report to improve your mail service. Usually contacting your mail hoster on this will be the best next step. In the communication with your mail hoster you can use the permalink (i.e. the URL) of the test report. ## Widget You can integrate the email test into your own website using our [widget code](/widget-mail/). ## Test your email

source: base test mail input
sv: Your email address:

source: base test mail label
sv: Test your email

source: base test mail text
sv: Modern address? Signed domain? Anti-phishing? Secure connection?

source: base test mail title
sv: About the email test

source: base test prechecks invalid domain
sv: **The given domain is invalid!** Explanation: An A and/or AAAA record is necessary for the website test, and a SOA record for the email test.

source: base test start
sv: Start test

source: base test website explain
sv: ## What is tested? After you enter a domain name of a website, we will test if the website offers support for the modern Internet Standards below. * [IPv6](/faqs/ipv6/): reachable via modern address? * [DNSSEC](/faqs/dnssec/): domain name signed? * [HTTPS](/faqs/https/): secure connection? * [Security options](/faqs/appsecpriv/): application security options set? ## Test report? After the test is finished, you are directed to a test report. The report contains an overall percentage score and results per test section and per subtest. For more information see ["Explanation of test report"](/faqs/report/). ## How to improve? You can use this test report to improve your website. Usually contacting your web hoster on this will be the best next step. In the communication with your web hoster you can use the permalink (i.e. the URL) of the test report. ## Widget You can integrate the website test into your own website using our [widget code](/widget-site/). ## Test your website

source: base test website input
sv: Your domain name:

source: base test website label
sv: Test your website

source: base test website text
sv: Modern address? Signed domain? Secure connection? Security options?

source: base test website title
sv: About the website test

source: base widget mail
sv: Email test widget

source: base widget site
sv: Website test widget

source: connection pagetitle
sv: Connection test

source: connection title
sv: Connection test

source: copyright content
sv: # Copyright ## Content Except where otherwise noted, content on this website is licensed under a [Creative Commons Attribution 4.0 International license](https://creativecommons.org/licenses/by/4.0/). ## Source code The software source code of Internet.nl is published under the [Apache License, version 2.0](https://opensource.org/licenses/Apache-2.0) on [Github](https://github.com/NLnetLabs/Internet.nl). ## Building blocks Internet.nl was made possible by using and combining other open source software. The main open source building blocks of Internet.nl are: - [Python 3](https://www.python.org/) (main programming language) - [Django](https://www.djangoproject.com/) (web framework) - [PostgreSQL](https://www.postgresql.org/) (database) - [Celery](http://www.celeryproject.org/) (asynchronous tasks backend) - [Redis](https://redis.io/) (cache backend for Django and Celery) - [RabbitMQ](https://www.rabbitmq.com/) (message broker for Celery) - [nassl](https://github.com/nabla-c0d3/nassl) (Python bindings for OpenSSL) - [unbound/libunbound](https://www.nlnetlabs.nl/projects/unbound/about/) (DNS related tests and functionality) - [Postfix](https://www.postfix.org/) (mail server for interactive email test, _beta_) ## Name and logo Both the name Internet.nl and the Internet.nl logo are explicitly excluded from the above licensing. Thus we do not grant permission to use these when our content or software code is reused.

source: detail conn dnssec validation exp
sv: We check if the resolvers that you use validate the DNSSEC signatures of our domain name. Resolvers are usually provided by your internet provider. Alternatively you can configure resolvers from another DNS provider. You can even use your own locally installed resolver. Although validation is done in the resolver, the communication from the resolver back to your device (referred to as 'last mile') could still be tampered with by an attacker. Thus the most secure way is to validate close to the end user device (e.g. by using a locally installed resolver), or make sure that the channel between your resolver and your end user device is secured/trusted.

source: detail conn dnssec validation label
sv: DNSSEC validation

source: detail conn dnssec validation tech table
sv: DNS provider

source: detail conn dnssec validation verdict bad
sv: You are *not* protected by DNSSEC signature validation.

source: detail conn dnssec validation verdict good
sv: You are protected by DNSSEC signature validation.

source: detail conn ipv6 connection exp
sv: We check if your device through its current internet connection is able to connect *directly* (i.e. without DNS translation) with our webserver using our corresponding IPv6 address. Some browser add-ons and routers offer functionality for domain filtering in order to enhance privacy or restrict internet use. To prevent circumvention this kind of functionality often blocks connecting to IP addresses directly, making your internet connection fail for this subtest.

source: detail conn ipv6 connection label
sv: IPv6 connectivity (direct)

source: detail conn ipv6 connection tech table
sv: IPv6 address|Reverse name|Internet provider

source: detail conn ipv6 connection verdict bad
sv: You are *not* able to reach computers directly on their IPv6 address.

source: detail conn ipv6 connection verdict good
sv: You are able to reach computers directly on their IPv6 address.

source: detail conn ipv6 dns-conn exp
sv: We check if your device through its current internet connection is able to connect to our webserver via IPv6. For this test we provide a domain name and we expect your resolver to resolve the domain name to the appropriate IPv6 address.

source: detail conn ipv6 dns-conn label
sv: IPv6 connectivity (via DNS)

source: detail conn ipv6 dns-conn verdict bad
sv: You are *not* able to reach computers via DNS on their IPv6 address.

source: detail conn ipv6 dns-conn verdict good
sv: You are able to reach computers via DNS on their IPv6 address.

source: detail conn ipv6 ipv4-conn exp
sv: We check if your device through its current internet connection is able to connect to our webserver via IPv4. For this test we provide a domain name and we expect your resolver to resolve the domain name to the appropriate IPv4 address. *Requirement level: Optional*

source: detail conn ipv6 ipv4-conn label
sv: IPv4 connection (via DNS)

source: detail conn ipv6 ipv4-conn tech table
sv: IPv4 address|Reverse name|Internet provider

source: detail conn ipv6 ipv4-conn verdict bad
sv: You are *not* able to reach computers via DNS on their IPv4 address.

source: detail conn ipv6 ipv4-conn verdict good
sv: You are able to reach computers via DNS on their IPv4 address.

source: detail conn ipv6 privacy exp
sv: We check if your device uses IPv6 Privacy Extensions for SLAAC (or another IPv6 configuration process than SLAAC) in order to prevent leakage of its potentially privacy sensitive MAC address to computers it connects with over IPV6.

source: detail conn ipv6 privacy label
sv: Privacy Extensions for IPv6

source: detail conn ipv6 privacy verdict bad
sv: You are using SLAAC *without* 'IPv6 Privacy Extensions'.

source: detail conn ipv6 privacy verdict good
sv: You have enabled 'IPv6 Privacy Extensions' (or you are not using SLAAC).

source: detail conn ipv6 resolver-conn exp
sv: We check if at least one of the DNS resolvers that you are using is able to reach our authoritative name servers over IPv6. Usually your internet provider provides the DNS resolver(s).

source: detail conn ipv6 resolver-conn label
sv: IPv6 connectivity of DNS resolver

source: detail conn ipv6 resolver-conn verdict bad
sv: Your DNS resolver is *not* able to reach name servers over IPv6.

source: detail conn ipv6 resolver-conn verdict good
sv: Your DNS resolver is able to reach name servers over IPv6.

source: detail mail auth dkim exp
sv: We check if your domain supports DKIM records. A receiving mail server can use the public key in your DKIM record to validate the signature in an email with a user from your domain as sender and determine its authenticity. * Currently we are not able to query and evaluate the public key in your DKIM record, because we would need the DKIM selector (that should be in the mails you send) to do so. * To pass this test we expect your name server to answer `NOERROR` to our query for `_domainkey.example.nl`. When `_domainkey.example.nl` is an 'empty non- terminal' some name servers that are not conformant with the standard RFC2308 incorrectly answer `NXDOMAIN` instead of `NOERROR`. This makes it impossible for us to detect support for DKIM records. * For this test we assume 'strict alignment' which is conformant with DMARC. The given domain is considered to be the sender domain in the mail body domain (`From:`) and this must be identical to the DKIM domain (`d=`) and the SPF domain (envelope sender, i.e. return-path that shows up in `MAIL FROM`).

source: detail mail auth dkim label
sv: DKIM existence

source: detail mail auth dkim verdict bad
sv: Your domain does *not* support DKIM records.

source: detail mail auth dkim verdict good
sv: Your domain supports DKIM records.

source: detail mail auth dmarc exp
sv: We check if DMARC is available for your domain. A receiving mail server may use your DMARC policy to evaluate how to handle a mail with your domain as sender that could not be authenticated with both DKIM and SPF, and it may use your mail address from the DMARC record to provide feedback reports on the authentication to you. Having more than one DMARC record in the same domain is not valid and will lead to a test failure. Note: DMARC requires the SPF domain (envelope sender, i.e. return-path that shows up in `MAIL FROM`) and the DKIM domain (`d=`) to align with the mail body domain (`From:`).

source: detail mail auth dmarc label
sv: DMARC existence

source: detail mail auth dmarc tech table
sv: DMARC record

source: detail mail auth dmarc verdict bad
sv: Your domain does *not* have a DMARC record.

source: detail mail auth dmarc verdict good
sv: Your domain has a DMARC record.

source: detail mail auth dmarc-policy exp
sv: We check if the syntax of your DMARC record is correct and if it contains a sufficiently strict policy (`p=quarantine` or `p=reject`) in order to prevent abuse of your domain by phishers and spammers. Even without a strict policy, DMARC can be useful to get more insight in legitimate and illegitimate outbound mail flows through DMARC reports. However to be effective against abuse of your domain, a liberal policy (`p=none`) is insufficient. We also check whether the mail addresses under `rua=` and `ruf=` are valid. In case they contain an external mail address we check whether the external domain is authorised to receive DMARC reports. Make sure that the DMARC authorization record on the external domain contains at least `"v=DMARC1;"`. As a quick win we recommend to set the most strict policy (`p=reject`) for your (sub-)domains that you do not use for sending mail in order to prevent abuse.

source: detail mail auth dmarc-policy label
sv: DMARC policy

source: detail mail auth dmarc-policy verdict bad
sv: Your DMARC policy is *not* syntactically correct.

source: detail mail auth dmarc-policy verdict external
sv: The domain of the external mail address following `rua=` and/or `ruf=` has *no* (valid) authorization record for receiving DMARC reports for the tested domain.

source: detail mail auth dmarc-policy verdict good
sv: Your DMARC policy is sufficiently strict.

source: detail mail auth dmarc-policy verdict policy
sv: Your DMARC policy is *not* sufficiently strict.

source: detail mail auth spf exp
sv: We check if your domain has an SPF record. A receiving mail server can use your whitelisted sending mail servers and the accompanying policy from your SPF record to determine the authenticity of a received email with your domain as sender. Having more than one SPF record in the same domain is not valid and will lead to a test failure.

source: detail mail auth spf label
sv: SPF existence

source: detail mail auth spf tech table
sv: SPF record

source: detail mail auth spf verdict bad
sv: You domain does *not* have an SPF record.

source: detail mail auth spf verdict good
sv: Your domain has an SPF record.

source: detail mail auth spf-policy exp
sv: We check if the syntax of your SPF record is correct and if it contains a sufficienly strict policy i.e. `~all` (softfail) or `-all` (hardfail) in order to prevent abuse by phishers and spammers. To be effective against abuse of your domain, a liberal policy i.e. `+all` (pass) or `?all` (neutral) is insufficient. If `all` is missing and a `redirect` modifier is not present in your SPF record, the default is `?all`. We also follow `include` and `redirect` for valid SPF records. A maximum of 10 DNS lookups are allowed when following those. If the `include` or `redirect` domain consists of macros, we will not follow them as we do not have the necessary information from an actual mail or mail server connection to expand those macros. Note that as a quick win we recommend you to set the most strict policy (`-all`) for (sub-)domains that you do not use for sending mail in order to prevent abuse.

source: detail mail auth spf-policy label
sv: SPF policy

source: detail mail auth spf-policy tech table
sv: Domain|SPF record

source: detail mail auth spf-policy verdict all
sv: Your SPF policy is *not* sufficiently strict.

source: detail mail auth spf-policy verdict bad
sv: Your SPF policy is *not* syntactically correct.

source: detail mail auth spf-policy verdict good
sv: Your SPF policy is sufficiently strict.

source: detail mail auth spf-policy verdict include
sv: Your SPF policy is *not* sufficiently strict. The 'include' mechanism in your SPF record points to an insufficiently strict SPF policy or a non-existing SPF record.

source: detail mail auth spf-policy verdict max-lookups
sv: Your SPF policy is *not* effective as it requires more than the allowed 10 DNS lookups. Note: we currently only count 'redirect' and 'include' as DNS lookups, but not 'a', 'mx', 'ptr' and 'exist'.

source: detail mail auth spf-policy verdict redirect
sv: Your SPF policy is *not* sufficiently strict. The 'redirect' modifier in your SPF record points to an insufficiently strict SPF policy or a non-existing SPF record.

source: detail mail dnssec exists exp
sv: We check if your domain is DNSSEC signed. With a DNSSEC signature senders who validate domain signatures can verify the authenticity of the DNS reply that contains your mail server domains (MX). This prevents an attacker from manipulating the DNS answer in order to redirect mails sent to you to the attacker's mailserver domain. If a domain redirects to another domain via `CNAME`, then we also check if the CNAME domain is signed (which is conformant with the DNSSEC standard). If the CNAME domain is not signed, the result of this subtest will be negative. Note: the validity of the signature is not part of this subtest, but part of the next subtest.

source: detail mail dnssec exists label
sv: DNSSEC existence

source: detail mail dnssec exists tech table
sv: Email address domain|Registrar

source: detail mail dnssec exists verdict bad
sv: Your email address domain is insecure, because it is *not* DNSSEC signed.

source: detail mail dnssec exists verdict good
sv: Your email address domain is DNSSEC signed.

source: detail mail dnssec exists verdict resolver-error
sv: Unfortunately an error occurred in Internet.nl's resolver. Please [contact](/about/) us.

source: detail mail dnssec exists verdict servfail
sv: The name servers of your email address domain are *broken*. They returned an error (`SERVFAIL`) to our queries for a DNSSEC signature. Please contact your name server operator (often your hosting provider and/or registrar) to fix this soon.
