Repository: pawal/ipv6.cool
Catalog: translations/*/main.po
Languages: sv

source: detail web appsecpriv http-x-xss exp
sv: We check if your web server provides an HTTP header for `X-XSS-Protection` that has a sufficiently secure value (i.e. `1` or `1; mode=block`). This HTTP header can be used to activate the protection filter of browsers against reflective cross-site scripting (XSS) attacks. Valid values for the `X-XSS-Protection` header are: * `0` disables the XSS filter. This value should NOT be used. * `1` enables the XSS filter. If a cross-site scripting attack is detected, the browser will sanitize the script and remove the unsafe parts. This value is usually the default in browers when a website does not offer an `X-XSS-Protection` header. * `1; mode=block` enables the XSS filter. If a cross-site scripting attack is detected, the browser will block the response and prevent rendering the page. This is the recommended value. `Content-Security-Policy` (CSP) offers similar protection and much more for visitors with modern web browsers. However `X-XSS-Protection` could still protect visitors of older web browsers that do not support CSP. Furthermore `X-XSS-Protection` could offer valueable protection for all visitors, when CSP is not (properly) configured for the website concerned. *Requirement level: Recommended*

source: detail web appsecpriv http-x-xss label
sv: X-XSS-Protection

source: detail web appsecpriv http-x-xss tech table
sv: Web server IP address|X-XSS-Protection value

source: detail web appsecpriv http-x-xss verdict bad
sv: Your web server does *not* offer securely configured X-XSS-Protection.

source: detail web appsecpriv http-x-xss verdict good
sv: Your web server offers securely configured X-XSS-Protection.

source: detail web dnssec exists exp
sv: We check if your domain is DNSSEC signed. If a domain redirects to another domain via `CNAME`, then we also check if the CNAME domain is signed (which is conformant with the DNSSEC standard). If the CNAME domain is not signed, the result of this subtest will be negative. Note: the validity of the signature is not part of this subtest, but part of the next subtest.

source: detail web dnssec exists label
sv: DNSSEC existence

source: detail web dnssec exists tech table
sv: Domain|Registrar

source: detail web dnssec exists verdict bad
sv: Your domain is insecure, because it is *not* DNSSEC signed.

source: detail web dnssec exists verdict good
sv: Your domain is DNSSEC signed.

source: detail web dnssec exists verdict resolver-error
sv: Unfortunately an error occurred in Internet.nl's resolver. Please [contact](/about/) us.

source: detail web dnssec exists verdict servfail
sv: The name servers of your domain are *broken*. They returned an error (`SERVFAIL`) to our queries for a DNSSEC signature. Please contact your name server operator (often your hosting provider and/or registrar) to fix this soon.

source: detail web dnssec valid exp
sv: We check if your domain is signed with a valid signature making it 'secure'. If a domain redirects to another signed domain via `CNAME`, then we also check if the signature of the CNAME domain is valid (which is conformant with the DNSSEC standard). If the signature of the CNAME domain is not valid, the result of this subtest will be negative.

source: detail web dnssec valid label
sv: DNSSEC validity

source: detail web dnssec valid tech table
sv: Domain|Status

source: detail web dnssec valid verdict bad
sv: Your domain is 'bogus', because the DNSSEC signature is *not* valid. Either someone manipulated the response from your name server, or your domain has a *serious DNSSEC configuration error*. The latter makes your domain unreachable for any user who validates DNSSEC signatures. You should contact your name server operator (often your registrar or hosting provider) as soon as possible.

source: detail web dnssec valid verdict good
sv: Your domain is secure, because its DNSSEC signature is valid.

source: detail web dnssec valid verdict unsupported-ds-algo
sv: Your domain is signed with an algorithm that our validating resolver currently does not support. Therefore we are not able to check the validity of its DNSSEC signature.

source: detail web ipv6 web-AAAA exp
sv: We check if there is at least one AAAA record with IPv6 address for your web server.

source: detail web ipv6 web-AAAA label
sv: IPv6 addresses for web server

source: detail web ipv6 web-AAAA tech table
sv: Web server|IPv6 address|IPv4 address

source: detail web ipv6 web-AAAA verdict bad
sv: *None* of your web servers has an IPv6 address.

source: detail web ipv6 web-AAAA verdict good
sv: At least one of your web servers has an IPv6 address.

source: detail web ipv6 web-ipv46 exp
sv: We compare the web content that we receive from your web server over both IPv6 and IPv4 on any available ports (80 and/or 443). In case there are multiple IPv6 and IPv4 addresses, we pick one IPv6 address and one IPv4 address. If the content difference is not higher than 10%, we expect the main web content to be the same. Therefore websites with small differences (for example due to changing ads) will pass this subtest as well.

source: detail web ipv6 web-ipv46 label
sv: Same website on IPv6 and IPv4

source: detail web ipv6 web-ipv46 verdict bad
sv: Your website on IPv6 does *not* seem to be the same as your website on IPv4.

source: detail web ipv6 web-ipv46 verdict good
sv: Your website on IPv6 seems to be the same as your website on IPv4.

source: detail web ipv6 web-reach exp
sv: We check if we can connect to your web server(s) over IPv6 on any available ports (80 and/or 443). We test all IPv6 addresses that we receive from your name servers. A partial score will be given if not all IPv6 addresses are reachable. If an IPv6 address is (syntactically) invalid, we consider it unreachable.

source: detail web ipv6 web-reach label
sv: IPv6 reachability of web server

source: detail web ipv6 web-reach tech table
sv: Web server|Unreachable IPv6 address

source: detail web ipv6 web-reach verdict bad
sv: At least one of your web servers with an IPv6 address is *not* reachable over IPv6.

source: detail web ipv6 web-reach verdict good
sv: All your web servers with an IPv6 address are reachable over IPv6.

source: detail web tls cert-hostmatch exp
sv: We check if the domain name of your website matches the domain name on the certificate. It could be useful to include more than one domain (e.g. the domain with and without www) as Subject Alternative Name on the certificate. See ['IT Security Guidelines for Transport Layer Security (TLS) v2.0'](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) from NCSC-NL, guideline B3-1 (in English).

source: detail web tls cert-hostmatch label
sv: Domain name on certificate

source: detail web tls cert-hostmatch tech table
sv: Web server IP address|Unmatched domains on certificate

source: detail web tls cert-hostmatch verdict bad
sv: The domain name of your website does *not* match the domain name on your website certificate.

source: detail web tls cert-hostmatch verdict good
sv: The domain name of your website matches the domain name on your website certificate.

source: detail web tls cert-pubkey exp
sv: We check if the (ECDSA or RSA) digital signature of your website certificate uses secure parameters. The verification of certificates makes use of digital signatures. To guarantee the authenticity of a connection, a trustworthy algorithm for certificate verification must be used. The algorithm that is used to sign a certificate is selected by its supplier. The certificate specifies the algorithm for digital signatures that is used by its owner during the key exchange. It is possible to configure multiple certificates to support more than one algorithm. The security of ECDSA digital signatures depends on the chosen curve. The security of RSA for encryption and digital signatures is tied to the key length of the public key. See ['IT Security Guidelines for Transport Layer Security (TLS) v2.0'](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) from NCSC-NL, guideline B5-1 and table 9 for ECDSA, and guideline B3-3 and table 8 for RSA (in English). --- **Elliptic curves for ECDSA** * Good: `secp384r1`, `secp256r1`, `x448`, and `x25519` * Phase out: `secp224r1` * Insufficient: Other curves **Length of RSA-keys** * Good: At least 3072 bit * Sufficient: 2048 – 3071 bit * Insufficient: Less than 2048 bit

source: detail web tls cert-pubkey label
sv: Public key of certificate

source: detail web tls cert-pubkey tech table
sv: Web server IP address|Affected signature parameters|Status

source: detail web tls cert-pubkey verdict bad
sv: The digital signature of your website certificate uses *insufficiently* secure parameters.

source: detail web tls cert-pubkey verdict good
sv: The digital signature of your website certificate uses secure parameters.

source: detail web tls cert-pubkey verdict phase-out
sv: The digital signature of your website certificate uses parameters that have a *phase out* status, because they are known to be fragile and are at risk of of becoming *insufficiently* secure.

source: detail web tls cert-signature exp
sv: We check if the signed fingerprint of the website certificate was created with a secure hashing algorithm. See ['IT Security Guidelines for Transport Layer Security (TLS) v2.0'](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) from NCSC-NL, guideline B3-2 and table 3 (in English). --- **Hash functions for certificate verification** * Good: SHA-512, SHA-384, SHA-256 * Insufficient: SHA-1, MD5

source: detail web tls cert-signature label
sv: Signature of certificate

source: detail web tls cert-signature tech table
sv: Web server IP address|Affected hash algorithm|Status

source: detail web tls cert-signature verdict bad
sv: Your website certificate is signed using a hash algorithm that is *insufficiently* secure.

source: detail web tls cert-signature verdict good
sv: Your website certificate is signed using a secure hash algorithm.

source: detail web tls cert-trust exp
sv: We check if we are able to build a valid chain of trust for your website certificate. For a valid chain of trust, your certificate must be published by a [publicly trusted certificate authority](https://www.mozilla.org/en-US/about/governance/policies/security-group/certs/), and your web server must present all necessary intermediate certificates. See ['IT Security Guidelines for Transport Layer Security (TLS)'](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) from NCSC-NL, guideline B3-4 (in English).

source: detail web tls cert-trust label
sv: Trust chain of certificate

source: detail web tls cert-trust tech table
sv: Web server IP address|Untrusted certificate chain

source: detail web tls cert-trust verdict bad
sv: The trust chain of your website certificate is *not* complete and/or *not* signed by a trusted root certificate authority.

source: detail web tls cert-trust verdict good
sv: The trust chain of your website certificate is complete and signed by a trusted root certificate authority.

source: detail web tls cipher-order exp
sv: We check if your web server enforces its own cipher preference ('I'), and offers ciphers in accordance with the prescribed ordering ('II'). If your web server supports 'Good' ciphers only, this test is not applicable as the ordering has no significant security advantage. I. *Server enforced cipher preference*: The web server enforces its own cipher preference while negotiating with a web browser, and does not accept any preference of the web browser. (*requirement level: Required*); II. *Prescribed ordering*: Ciphers are offered by the web server in accordance with the below prescribed order in which safe and fast ciphers are preferred. A. Prefer 'Good' over 'Sufficient' over 'Phase out' ciphers (*requirement level: Required*); B. Within a particular security level, proceed as follows: 1. Ciphers that perform key exchange based on elliptic curves are preferred over those that use finite fields. Both are preferred over ciphers that use a static key exchange (*requirement level: Recommended*); 2. Ciphers that do bulk encryption based on AEAD algorithms are preferred over alternatives (*requirement level: Recommended*); 3. Ciphers that do certificate verification based on ECDSA are preferred over RSA (*requirement level: Recommended*); 4. Ciphers are preferred in descending order of their key and then hash size (*requirement level: Recommended*); 5. AES-256 is preferred over ChaCha20 (*requirement level: Optional*). In the above table with technical details **only the first found out of prescribed order algorithm selections** are listed, with the violated prescribed ordering rule shown next to it. See ['IT Security Guidelines for Transport Layer Security (TLS)'](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) from NCSC-NL, guideline B2-5.

source: detail web tls cipher-order label
sv: Cipher order

source: detail web tls cipher-order tech table
sv: Web server IP address|First found affected cipher pair|Violated rule # ('II-B')

source: detail web tls cipher-order verdict bad
sv: Your web server does *not* enforce its own cipher preference ('I').

source: detail web tls cipher-order verdict good
sv: Your web server enforces its own cipher preference ('I'), and offers ciphers in accordance with the prescribed ordering ('II').

source: detail web tls cipher-order verdict na
sv: This subtest is not applicable as your web server supports 'Good' ciphers only.

source: detail web tls cipher-order verdict seclevel-bad
sv: Your web server does *not* prefer 'Good' over 'Sufficient' over 'Phase out' ciphers ('II-A').

source: detail web tls cipher-order verdict warning
sv: Your web server does *not* offer ciphers in accordance with the prescribed ordering within a particular security level ('II-B').

source: detail web tls ciphers exp
sv: We check if your web server supports secure ciphers (algorithm selections) only. An algorithm selection consists of ciphers for four cryptographic functions: 1) key exchange, 2) certificate verification, 3) bulk encryption, and 4) hashing. A web server may support more than one algorithm selection. * Since TLS 1.3, the term 'cipher suite' only comprises ciphers used for bulk encryption and hashing. When using TLS 1.3 the ciphers for key exchange and certificate verification are negotiable and not part of the naming of the cipher suite. Because this makes the term 'cipher suite' ambiguous, NCSC-NL uses the term 'algorithm selection' to comprise all four cipher functions. * NCSC-NL uses the [IANA naming convention](https://www.iana.org/assignments/tls-parameters/tls-parameters.xhtml#tls-parameters-4) for algorithm selections. Internet.nl uses the [OpenSSL naming convention](https://www.openssl.org/docs/manmaster/man1/openssl-ciphers.html#CIPHER-SUITE-NAMES). Since TLS 1.3 OpenSSL follows the IANA naming convention. A translation between both can be found in the OpenSSL documentation. See ['IT Security Guidelines for Transport Layer Security (TLS)'](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) from NCSC-NL, guideline B2-1 to B2-4 and table 2, 4, 6 and 7 (in English). --- Below you find 'Good', 'Sufficient' and 'Phase out' algorithm selections in the by NCSC-NL prescibed order, based on appendix C of the 'IT Security Guidelines for Transport Layer Security (TLS)'. Behind every algorithm selection is the minimum TLS version (e.g. [1.2]) that supports this algorithm selection and that is at least 'Phase out'. Good: * `ECDHE-ECDSA-AES256-GCM-SHA384` (`TLS_AES_256_GCM_SHA384` in 1.3) [1.2] * `ECDHE-ECDSA-CHACHA20-POLY1305` (`TLS_CHACHA20_POLY1305_SHA256` in 1.3) [1.2] * `ECDHE-ECDSA-AES128-GCM-SHA256` (`TLS_AES_128_GCM_SHA256` in 1.3) [1.2] * `ECDHE-RSA-AES256-GCM-SHA384` (`TLS_AES_256_GCM_SHA384` in 1.3) [1.2] * `ECDHE-RSA-CHACHA20-POLY1305` (`TLS_CHACHA20_POLY1305_SHA256` in 1.3) [1.2] * `ECDHE-RSA-AES128-GCM-SHA256` (`TLS_AES_128_GCM_SHA256` in 1.3) [1.2] Sufficient: * `ECDHE-ECDSA-AES256-SHA384` [1.2] * `ECDHE-ECDSA-AES256-SHA` [1.0] * `ECDHE-ECDSA-AES128-SHA256` [1.2] * `ECDHE-ECDSA-AES128-SHA` [1.0] * `ECDHE-RSA-AES256-SHA384` [1.2] * `ECDHE-RSA-AES256-SHA` [1.0] * `ECDHE-RSA-AES128-SHA256` [1.2] * `ECDHE-RSA-AES128-SHA` [1.0] * `DHE-RSA-AES256-GCM-SHA384` [1.2] * `DHE-RSA-CHACHA20-POLY1305` [1.2] * `DHE-RSA-AES128-GCM-SHA256` [1.2] * `DHE-RSA-AES256-SHA256` [1.2] * `DHE-RSA-AES256-SHA` [1.0] * `DHE-RSA-AES128-SHA256` [1.2] * `DHE-RSA-AES128-SHA` [1.0] Phase out: * `ECDHE-ECDSA-DES-CBC3-SHA` [1.0] * `ECDHE-RSA-DES-CBC3-SHA` [1.0] * `DHE-RSA-DES-CBC3-SHA` [1.0] * `AES256-GCM-SHA384` [1.2] * `AES128-GCM-SHA256` [1.2] * `AES256-SHA256` [1.2] * `AES256-SHA` [1.0] * `AES128-SHA256` [1.2] * `AES128-SHA` [1.0] * `DES-CBC3-SHA` [1.0]

source: detail web tls ciphers label
sv: Ciphers (Algorithm selections)

source: detail web tls ciphers tech table
sv: Web server IP address|Affected ciphers|Status

source: detail web tls ciphers verdict bad
sv: Your web server supports one or more *insufficiently* secure ciphers.

source: detail web tls ciphers verdict good
sv: Your web server supports secure ciphers only.

source: detail web tls ciphers verdict phase-out
sv: Your web server supports one or more ciphers that have a *phase out* status, because they are known to be fragile and are at risk of becoming *insufficiently* secure.

source: detail web tls compression exp
sv: We check if your web server supports TLS compression. The use of compression can give an attacker information about the secret parts of encrypted communication. An attacker that can determine or control parts of the data sent can reconstruct the original data by performing a large number of requests. TLS compression is used so rarely that disabling it is generally not a problem. See ['IT Security Guidelines for Transport Layer Security (TLS)'](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) from NCSC-NL, guideline B7-1 and table 11 (in English).

source: detail web tls compression label
sv: TLS compression

source: detail web tls compression tech table
sv: Web server IP address|TLS compression

source: detail web tls compression verdict bad
sv: Your web server supports TLS compression, which is *not* secure.

source: detail web tls compression verdict good
sv: Your web server does not support TLS compression.

source: detail web tls dane-exists exp
sv: We check if the name servers of your website domain contain a correcly signed TLSA record for DANE. As DNSSEC is preconditional for DANE, this test will fail in case DNSSEC is missing on the website domain, or if there are DANE related DNSSEC issues (e.g. no proof of 'Denial of Existence'). See ['IT Security Guidelines for Transport Layer Security (TLS)'](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) from NCSC-NL, Appendix A, under 'Certificate pinning and DANE' (in English). *Requirement level: Optional*

source: detail web tls dane-exists label
sv: DANE existence

source: detail web tls dane-exists tech table
sv: Web server IP address|DANE TLSA record existent

source: detail web tls dane-exists verdict bad
sv: Your website domain does *not* contain a TLSA record for DANE.

source: detail web tls dane-exists verdict bogus
sv: Your website domain does *not* provide DNSSEC proof that DANE TLSA records do not exist. You should ask your name server operator to fix this issue.

source: detail web tls dane-exists verdict good
sv: Your website domain contains a TLSA record for DANE.

source: detail web tls dane-rollover exp
sv: OUTDATED TEXT; TEST NOT USED We check if your website domain has a proper DANE rollover scheme to handle DANE certificate rollovers. Having a DANE rollover scheme in place is not required. It will be proven useful when there is a need to update your DANE certificate and you want to ensure that DANE validation will continue to work during the transition period. The way to achieve this is by publishing two different TLSA records. The configurations of the TLSA record types are the following: - record type 3 1 1 (current key) + record type 3 1 1 (future key), or - record type 3 1 1 (current key) + record type 2 1 1 (trusted CA).

source: detail web tls dane-rollover label
sv: OUTDATED TEXT; TEST NOT USED DANE rollover scheme

source: detail web tls dane-rollover tech table
sv: OUTDATED TEXT; TEST NOT USED Web server IP address|DANE rollover scheme

source: detail web tls dane-rollover verdict bad
sv: OUTDATED TEXT; TEST NOT USED Your website domain does *not* have a proper scheme for rolling DANE certificates.

source: detail web tls dane-rollover verdict good
sv: OUTDATED TEXT; TEST NOT USED Your website domain has a proper scheme for rolling DANE certificates.

source: detail web tls dane-valid exp
sv: We check if the DANE fingerprint presented by your domain is valid for your web certificate. DANE allows you to publish information about your website certificate in a special DNS record, called TLSA record. Clients, like web browsers, can check the authenticity of your certificate not only through the certificate authority but also through the TLSA record. A client can also use the TLSA record as a signal to only use HTTPS (and not HTTP). DNSSEC is preconditional for DANE. Unfortunately not much web browsers are supporting DANE validation yet. *Requirement level: Recommended (only if subtest for 'DANE existence' is passed)*

source: detail web tls dane-valid label
sv: DANE validity

source: detail web tls dane-valid tech table
sv: Web server IP address|DANE TLSA record valid

source: detail web tls dane-valid verdict bad
sv: The DANE fingerprint on your domain is *not* valid for your web certificate. Either someone manipulated the response from your name server, or your domain has a serious DANE configuration error. The latter makes your website unreachable for any user who check DANE fingerprints. You should contact your name server operator and/or your hosting provider as soon as possible.

source: detail web tls dane-valid verdict good
sv: The DANE fingerprint on your domain is valid for your web certificate.
