Repository: pawal/ipv6.cool
Catalog: translations/*/main.po
Languages: sv

source: test mailtls warning description
sv: Too bad! Sending mail servers that support secure email transport ([STARTTLS and DANE](/faqs/starttls/)) can establish *no* or an *insufficiently* secure connection with your receiving mail server(s). Passive and/or active attackers will therefore be able to read emails in transit to you. You should ask your mail provider to enable STARTTLS and DANE, and configure it securely.

source: test mailtls warning summary
sv: Mail server connection *not* or insufficiently secured (STARTTLS and DANE)

source: test siteappsecpriv failed description
sv: Too bad! *Not* all required application security options are set for your website ([Security options](/faqs/appsecpriv/)). With these options you can activate browser mechanisms to protect visitors against attacks with e.g. cross-site scripting (XSS) or framing. Note that we consider HTTPS as a requirement for this test category, and that these security options are *not* relevant for domains that redirect (through 301/302 redirect).

source: test siteappsecpriv failed summary
sv: One or more required application security options *not* set (Security options)

source: test siteappsecpriv info description
sv: Informational: *Not* all optional application security options are set for your website ([Security options](/faqs/appsecpriv/)). With these options you can activate browser mechanisms to protect visitors against attacks with e.g. cross-site scripting (XSS) or framing. Note that we consider HTTPS as a requirement for this test category, and that these security options are *not* relevant for domains that redirect (through 301/302 redirect).

source: test siteappsecpriv info summary
sv: One or more optional application security options *not* set (Security options)

source: test siteappsecpriv label
sv: Security options

source: test siteappsecpriv passed description
sv: Well done! All application security options are set for your website ([Security options](/faqs/appsecpriv/)). With these options you can activate browser mechanisms to protect visitors against attacks with e.g. cross-site scripting (XSS) or framing. Note that we consider HTTPS as a requirement for this test category, and that these security options are *not* relevant for domains that redirect (through 301/302 redirect).

source: test siteappsecpriv passed summary
sv: All application security options set (Security options)

source: test siteappsecpriv title
sv: Application security options set?

source: test siteappsecpriv warning description
sv: Warning: *Not* all recommended application security options are set for your website ([Security options](/faqs/appsecpriv/)). With these options you can activate browser mechanisms to protect visitors against attacks with e.g. cross-site scripting (XSS) or framing. Note that we consider HTTPS as a requirement for this test category, and that these security options are *not* relevant for domains that redirect (through 301/302 redirect).

source: test siteappsecpriv warning summary
sv: One or more recommended application security options *not* set (Security options)

source: test sitednssec failed description
sv: Too bad! Your domain is *not* signed with a valid signature ([DNSSEC](/faqs/dnssec/)). Therefore visitors with enabled domain signature validation, are *not* protected against manipulated translation from your domain into rogue internet addresses. You should ask your name server operator (often your registrar and/or hosting provider) to enable DNSSEC.

source: test sitednssec failed summary
sv: Domain name *not* signed (DNSSEC)

source: test sitednssec info description
sv: Too bad! Your domain is *not* signed with a valid signature ([DNSSEC](/faqs/dnssec/)). Therefore visitors with enabled domain signature validation, are *not* protected against manipulated translation from your domain into rogue internet addresses. You should ask your name server operator (often your registrar and/or hosting provider) to enable DNSSEC.

source: test sitednssec info summary
sv: Domain name *not* signed (DNSSEC)

source: test sitednssec label
sv: Signed domain name (DNSSEC)

source: test sitednssec passed description
sv: Well done! Your domain is signed with a valid signature ([DNSSEC](/faqs/dnssec/)). Therefore visitors with enabled domain signature validation, are protected against manipulated translation from your domain into rogue internet addresses.

source: test sitednssec passed summary
sv: Domain name signed (DNSSEC)

source: test sitednssec title
sv: Domain name signed?

source: test sitednssec warning description
sv: Too bad! Your domain is *not* signed with a valid signature ([DNSSEC](/faqs/dnssec/)). Therefore visitors with enabled domain signature validation, are *not* protected against manipulated translation from your domain into rogue internet addresses. You should ask your name server operator (often your registrar and/or hosting provider) to enable DNSSEC.

source: test sitednssec warning summary
sv: Domain name *not* signed (DNSSEC)

source: test siteipv6 failed description
sv: Too bad! Your website is *not* reachable for visitors using a modern internet address ([IPv6](/faqs/ipv6/)), or improvement is possible. Therefore your website is not part of the modern Internet yet. You should ask your hosting provider to fully enable IPv6.

source: test siteipv6 failed summary
sv: *Not* reachable via modern internet address, or improvement possible (IPv6)

source: test siteipv6 info description
sv: Too bad! Your website is *not* reachable for visitors using a modern internet address ([IPv6](/faqs/ipv6/)), or improvement is possible. Therefore your website is not part of the modern Internet yet. You should ask your hosting provider to fully enable IPv6.

source: test siteipv6 info summary
sv: *Not* reachable via modern internet address, or improvement possible (IPv6)

source: test siteipv6 label
sv: Modern address (IPv6)

source: test siteipv6 passed description
sv: Well done! Your website is reachable for visitors using a modern internet address ([IPv6](/faqs/ipv6/)), making it fully part of the modern Internet.

source: test siteipv6 passed summary
sv: Reachable via modern internet address (IPv6)

source: test siteipv6 title
sv: Reachable via modern address?

source: test siteipv6 warning description
sv: Too bad! Your website is *not* reachable for visitors using a modern internet address ([IPv6](/faqs/ipv6/)), or improvement is possible. Therefore your website is not part of the modern Internet yet. You should ask your hosting provider to fully enable IPv6.

source: test siteipv6 warning summary
sv: *Not* reachable via modern internet address, or improvement possible (IPv6)

source: test sitetls failed description
sv: Too bad! The connection with your website is *not* or *insufficiently* secured ([HTTPS](/faqs/https/)). Therefore information in transit between your website and its visitors is *not* sufficiently protected against eavesdropping and tampering. You should ask your hosting provider to enable HTTPS and to configure it securely.

source: test sitetls failed summary
sv: Connection *not* or insufficiently secured (HTTPS)

source: test sitetls info description
sv: Too bad! The connection with your website is *not* or *insufficiently* secured ([HTTPS](/faqs/https/)). Therefore information in transit between your website and its visitors is *not* sufficiently protected against eavesdropping and tampering. You should ask your hosting provider to enable HTTPS and to configure it securely.

source: test sitetls info summary
sv: Connection *not* or insufficiently secured (HTTPS)

source: test sitetls label
sv: Secure connection (HTTPS)

source: test sitetls passed description
sv: Well done! The connection with your website is sufficiently secured ([HTTPS](/faqs/https/)). Therefore information in transit between your website and its visitors is protected against eavesdropping and tampering.

source: test sitetls passed summary
sv: Connection sufficiently secured (HTTPS)

source: test sitetls title
sv: Secure connection?

source: test sitetls warning description
sv: Too bad! The connection with your website is *not* or *insufficiently* secured ([HTTPS](/faqs/https/)). Therefore information in transit between your website and its visitors is *not* sufficiently protected against eavesdropping and tampering. You should ask your hosting provider to enable HTTPS and to configure it securely.

source: test sitetls warning summary
sv: Connection *not* or insufficiently secured (HTTPS)

source: widget content notes
sv: ## Notes * Logo: We recommend you to save and use our [logo](/static/logo_en.svg) on your own web server. In that way there will not be any contact with our web server when your website is visited. * Content-Security-Policy (CSP): In case you are using a CSP policy for your website you would also need to add `internet.nl` to the rules for `form-action` and possibly also for `img-src` in case you link to the logo on our webserver.

source: widget mail html-block
sv: **Test your email**

source: widget mail intro
sv: # Email test widget Would you like visitors of your website to be able to directly start an email test? Copy the HTML and CSS code from the text fields below into the source code of your website.

source: widget site html-block
sv: **Test your website**

source: widget site intro
sv: # Website test widget Would you like visitors of your website to be able to directly start a website test? Copy the HTML and CSS code from the text fields below into the source code of your website.
