Repository: pawal/ipv6.cool
Catalog: translations/*/main.po
Languages: sv

source: detail web tls fs-params exp
sv: We check if the public parameters used in Diffie-Hellman key exchange by your web server are secure. The security of elliptic curve Diffie-Hellman (ECDHE) ephemeral key exchange depends on the used elliptic curve. We check if the bit-length of the used elliptic curves is a least 224 bits. Currently we are not able to check the elliptic curve name. The security of Diffie-Hellman Ephemeral (DHE) key exchange depends on the lengths of the public and secret keys used within the chosen finite field group. We test if your DHE public key material uses one of the predefined finite field groups that are specified in [RFC 7919](https://tools.ietf.org/html/rfc7919). Self-generated groups are 'Insufficient'. The larger key sizes required for the use of DHE come with a performance penalty. Carefully evaluate and use ECDHE instead of DHE if you can. Besides ECDHE and DHE, RSA can be used for key exchange. However, it is at risk of becoming insufficiently secure (current status 'phase out'). The RSA public parameters are tested in the subtest 'Public key of certificate'. Note that RSA is considered as 'good' for certificate verification. See ['IT Security Guidelines for Transport Layer Security (TLS)'](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) from NCSC-NL, guideline B5-1 and table 9 for ECDHE, and guideline B6-1 and table 10 for DHE (in English). --- **Elliptic curve for ECDHE** * Good: `secp384r1`, `secp256r1`, `x448`, and `x25519` * Phase out: `secp224r1` * Insufficient: Other curves **Finite field group for DHE** Sufficient: * [ffdhe4096](https://raw.githubusercontent.com/internetstandards/dhe_groups/master/ffdhe4096.pem) (RFC 7919) sha256 checksum: `64852d6890ff9e62eecd1ee89c72af9af244dfef5b853bcedea3dfd7aade22b3` * [ffdhe3072](https://raw.githubusercontent.com/internetstandards/dhe_groups/master/ffdhe3072.pem) (RFC 7919) sha256 checksum: `c410cc9c4fd85d2c109f7ebe5930ca5304a52927c0ebcb1a11c5cf6b2386bbab` Phase out: * [ffdhe2048](https://raw.githubusercontent.com/internetstandards/dhe_groups/master/ffdhe2048.pem) (RFC 7919) sha256 checksum: `9ba6429597aeed2d8617a7705b56e96d044f64b07971659382e426675105654b` Insufficient: Other groups

source: detail web tls fs-params label
sv: Key exchange parameters

source: detail web tls fs-params tech table
sv: Web server IP address|Affected parameters|Status

source: detail web tls fs-params verdict bad
sv: Your web server supports *insufficiently* secure parameters for Diffie-Hellman key exchange.

source: detail web tls fs-params verdict good
sv: Your web server supports secure parameters for Diffie-Hellman key exchange.

source: detail web tls fs-params verdict na
sv: This subtest is not applicable as your webserver does *not* support Diffie-Hellman key exchange. Note that RSA is an alternative for key exchange, but has the *phase out* status.

source: detail web tls fs-params verdict phase-out
sv: Your web server supports parameters for Diffie-Hellman key exchange that have a *phase out* status, because they are known to be fragile and are at risk of of becoming *insufficiently* secure.

source: detail web tls http-compression exp
sv: We test if your web server supports HTTP compression. HTTP compression makes the secure connection with your webserver vulnerable for the BREACH attack. However HTTP compression is commonly used to make more efficient use of available bandwidth. Consider the trade-offs involved with HTTP compression. If you choose to use HTTP compression, verify if it is possible to mitigate related attacks at the application level. An example of such a measure is limiting the extent to which an attacker can influence the response of a server. This subtest checks if the web server on root directory level supports HTTP compression. However it does not check additional website sources like images and scripts. See ['IT Security Guidelines for Transport Layer Security (TLS)'](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) from NCSC-NL, guideline B7-1 and table 11. *Requirement level: Optional*

source: detail web tls http-compression label
sv: HTTP compression

source: detail web tls http-compression tech table
sv: Web server IP address|HTTP compression

source: detail web tls http-compression verdict bad
sv: Your web server supports HTTP compression, which could be a security risk.

source: detail web tls http-compression verdict good
sv: Your web server does not support HTTP compression.

source: detail web tls https-exists exp
sv: We check if your website is reachable on HTTPS. If so, we also check in the below subtests whether HTTPS is configured sufficiently secure in conformance with the ['IT Security Guidelines for Transport Layer Security (TLS)'](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) from NCSC-NL. HTTPS guarantees the confidentiality and integrity of the exchanged information. Because it is situation depended how (privacy) sensitive and valuable information is, a secure HTTPS configuration is important for every website. Even trivial, public information could be extremely sensitive and valuable for a user. Note: for performance reasons the HTTPS test section only runs for the first available IPv6 and IPv4 address.

source: detail web tls https-exists label
sv: HTTPS available

source: detail web tls https-exists tech table
sv: Web server IP address|HTTPS existent

source: detail web tls https-exists verdict bad
sv: Your website does *not* offer HTTPS.

source: detail web tls https-exists verdict good
sv: Your website offers HTTPS.

source: detail web tls https-exists verdict other
sv: Your web server is unreachable.

source: detail web tls https-forced exp
sv: We check if your web server automatically redirects vistors from HTTP to HTTPS on the same domain (through a 301/302 redirect), or if it offers support for only HTTPS and not for HTTP. In case of redirecting, a domain should firstly upgrade itself by redirecting to its HTTPS version before it may redirect to another domain. This also ensures that the HSTS policy will be accepted by the web browser. Examples of correct redirect order: * `http://example.nl` ⇒ `https://example.nl` ⇒ `https://www.example.nl` * `http://www.example.nl` ⇒ `https://www.example.nl` See ['Web application guidelines, detailed version'](https://www.ncsc.nl/documenten/publicaties/2019/mei/01/ict-beveiligingsrichtlijnen-voor-webapplicaties) from NCSC-NL, guideline U/WA.05 (in Dutch).

source: detail web tls https-forced label
sv: HTTPS redirect

source: detail web tls https-forced tech table
sv: Web server IP address|HTTPS redirect

source: detail web tls https-forced verdict bad
sv: Your web server does offer support for both HTTP and HTTPS, but does *not* automatically redirect visitors from HTTP to HTTPS on the same domain.

source: detail web tls https-forced verdict good
sv: Your web server automatically redirects visitors from HTTP to HTTPS on the same domain.

source: detail web tls https-forced verdict other
sv: Your web server only offers support for HTTPS and not for HTTP.

source: detail web tls https-hsts exp
sv: We check if your web server supports HSTS. Browsers remember HSTS per (sub) domain. Not adding a HSTS header to every (sub) domain (in a redirect chain) might leave users vulnerable to MITM attacks. Therefore we check for HSTS on the first contact i.e. before any redirect. HSTS forces a web browser to connect directly via HTTPS when revisiting your website. This helps preventing man-in-the-middle attacks. We consider a HSTS cache validity period (`max-age`) of at least six months to be sufficiently secure. A long period is beneficial because it also protects infrequent visitors. However if you want to stop supporting HTTPS, you will have to wait longer until the validity of the HSTS policy in all browsers that vistited your website, has expired. See ['Web application guidelines, detailed version'](https://www.ncsc.nl/documenten/publicaties/2019/mei/01/ict-beveiligingsrichtlijnen-voor-webapplicaties) from NCSC-NL, guideline U/WA.05 (in Dutch).

source: detail web tls https-hsts label
sv: HSTS

source: detail web tls https-hsts tech table
sv: Web server IP address|HSTS policy

source: detail web tls https-hsts verdict bad
sv: Your web server does *not* offer an HSTS policy.

source: detail web tls https-hsts verdict good
sv: Your web server offers an HSTS policy.

source: detail web tls https-hsts verdict other
sv: Your web server offers an HSTS policy with a cache validity period (`max-age`) that is *not* sufficiently long (i.e. less than 6 months).

source: detail web tls kex-hash-func exp
sv: We check if your web server supports secure hash functions to create the digital signature during key exchange. The web server uses a digital signature during the key exchange to prove ownership of the secret key corresponding to the certificate. The web server creates this digital signature by signing the output of a hash function. See ['IT Security Guidelines for Transport Layer Security (TLS)'](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) from NCSC-NL, table 5. *Requirement level: Recommended* --- **SHA2 support for signatures** * Good: Yes (SHA-256, SHA-384 or SHA-512 supported) * Phase out: No (SHA-256, SHA-384 of SHA-512 *not* supported)

source: detail web tls kex-hash-func label
sv: Hash function for key exchange

source: detail web tls kex-hash-func tech table
sv: Web server IP address|SHA2 support for signatures

source: detail web tls kex-hash-func verdict good
sv: Your web server supports a secure hash function for key exchange.

source: detail web tls kex-hash-func verdict other
sv: We were unable to determine the hash function used by your webserver. This could be because the cipher combination used has no signature for certificate verification (e.g it uses RSA key exchange or is anonymous i.e. `anon`).

source: detail web tls kex-hash-func verdict phase-out
sv: Your web server does *not* support a secure hash function for key exchange. You should *phase out* this setting deliberately, because it is at risk of becoming *insufficiently* secure in the future.

source: detail web tls ocsp-stapling exp
sv: We check if your web server supports the [TLS Certificate Status extension](https://tools.ietf.org/html/rfc6961) also known as OCSP stapling. The web browser can verify the validity of the certificate presented by the web server by contacting the certificate authority using the OCSP protocol. OCSP provides a certificate authority with information on browsers communicating to the web server: this may be a privacy risk. A web server can also provide OCSP responses to web browsers itself through OCSP stapling. This solves this privacy risk, does not require connectivity between web browser and certificate authority, and is faster. When connecting to your web server we use the TLS Certificate Status extension to request OCSP data be included in the server response. If your web server includes OCSP data in the response we then verify that the OCSP data is valid i.e. correctly signed by a known certificate authority. Note: we do not use the OCSP data to evaluate the validity of the certificate. See ['IT Security Guidelines for Transport Layer Security (TLS)'](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) from NCSC-NL, table 15 (in English). --- **OCSP stapling** * Good: On * Sufficient: Off

source: detail web tls ocsp-stapling label
sv: OCSP stapling

source: detail web tls ocsp-stapling tech table
sv: Web server IP address|OCSP stapling

source: detail web tls ocsp-stapling verdict bad
sv: Your web server supports OCSP stapling but the data in the response is *not* valid.

source: detail web tls ocsp-stapling verdict good
sv: Your web server supports OCSP stapling and the data in the response is valid.

source: detail web tls ocsp-stapling verdict ok
sv: Your web server does *not* support OCSP stapling.

source: detail web tls renegotiation-client exp
sv: We check if a client (usually a web browser) can initiate a renegotiation with your web server. Allowing clients to initiate renegotiation is generally not necessary and opens a web server to DoS attacks inside a TLS connection. An attacker can perform similar DoS-attacks without client-initiated renegotiation by opening many parallel TLS connections, but these are easier to detect and defend against using standard mitigations. Note that client-initiated renegotiation impacts availability and not confidentiality. See ['IT Security Guidelines for Transport Layer Security (TLS)'](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) from NCSC-NL, guideline B8-1 and table 13 (in English).

source: detail web tls renegotiation-client label
sv: Client-initiated renegotiation

source: detail web tls renegotiation-client tech table
sv: Web server IP address|Client-initiated renegotiation

source: detail web tls renegotiation-client verdict bad
sv: Your web server allows for client-initiated renegotiation, which is *not* secure.

source: detail web tls renegotiation-client verdict good
sv: Your web server does not allow for client-initiated renegotiation.

source: detail web tls renegotiation-secure exp
sv: We check if your web server supports secure renegotiaton. Older versions of TLS (prior to TLS 1.3) allow forcing a new handshake. This so-called renegotiation was insecure in its original design. The standard was repaired and a safer renegotiation mechanism was added. The old version is since called insecure renegotiation and should be disabled. See ['IT Security Guidelines for Transport Layer Security (TLS)'](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) from NCSC-NL, guideline B8-1 and table 12 (in English).

source: detail web tls renegotiation-secure label
sv: Secure renegotiation

source: detail web tls renegotiation-secure tech table
sv: Web server IP address|Secure renegotiation

source: detail web tls renegotiation-secure verdict bad
sv: Your web server supports insecure renegotiation, which is obviously *not* secure.

source: detail web tls renegotiation-secure verdict good
sv: Your web server supports secure renegotiation.

source: detail web tls version exp
sv: We check if your web server supports secure TLS versions only. A web server may support more than one TLS version. Note: Browser makers have announced that they will stop supporting TLS 1.1 and 1.0 by Q1 2020. This will cause websites that do not support TLS 1.2 and/or 1.3 to be unreachable. See ['IT Security Guidelines for Transport Layer Security (TLS) v2.0'](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) from NCSC-NL, guideline B1-1 and table 1 (in English). --- * Good: TLS 1.3 and 1.2 * Phase out: TLS 1.1 and 1.0 * Insufficient: SSL 3.0, 2.0 and 1.0

source: detail web tls version label
sv: TLS version

source: detail web tls version tech table
sv: Web server IP address|Affected TLS version|Status

source: detail web tls version verdict bad
sv: Your web server supports *insufficiently* secure TLS versions.

source: detail web tls version verdict good
sv: Your web server supports secure TLS versions only.

source: detail web tls version verdict phase-out
sv: Your web server supports TLS versions that should be *phased out* deliberately, because they are known to be fragile and at risk of becoming *insufficiently* secure.

source: detail web tls zero-rtt exp
sv: We check if your web server supports Zero Round Trip Time Resumption (0-RTT). 0-RTT is an option in TLS 1.3 that transports application data during the first handshake message. 0-RTT does not provide protection against replay attacks at the TLS layer and therefore should be disabled. Although the risk can be mitigated by not allowing 0-RTT for non-idempotent requests, such a configuration is often not trivial, reliant on application logic and thus error prone. If your web server does not support TLS 1.3, the test is not applicable. For web servers that support TLS 1.3, the index `/` page of the website is fetched using TLS 1.3 and the amount of [early data](https://www.openssl.org/docs/manmaster/man3/SSL_get_max_early_data.html) support [indicated](https://tools.ietf.org/html/rfc8446#section-4.2.10) by the server is checked. When more than zero, a second connection is made re-using the TLS session details of the first connection but sending the HTTP request _before_ the TLS handshake (i.e. no round trips (0-RTT) needed before application data to the server). If the TLS handshake is completed and the web server responds with any non-[HTTP 425 Too Early](https://tools.ietf.org/html/rfc8470#section-5.2) response, then the web server is considered to support 0-RTT. See ['IT Security Guidelines for Transport Layer Security (TLS)'](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) from NCSC-NL, guideline B9-1 and table 14 (in English).

source: detail web tls zero-rtt label
sv: 0-RTT

source: detail web tls zero-rtt tech table
sv: Web server IP address|0-RTT

source: detail web tls zero-rtt verdict bad
sv: Your web server supports 0-RTT, which is *not* secure.

source: detail web tls zero-rtt verdict good
sv: Your web server does not support 0-RTT.

source: detail web tls zero-rtt verdict na
sv: This subtest is not applicable as your webserver does not support TLS 1.3.

source: detail web-mail ipv6 ns-AAAA exp
sv: We check if your domain name has at least two name servers with an IPv6 address. This is consistent with the [technical requirement of SIDN](https://www.sidn.nl/downloads/terms-and-conditions/Technical_requirements_for_the_registration_and_use_of_nl_domain_names.pdf) (.nl TLD registry) that each .nl domain must have at least two name servers.

source: detail web-mail ipv6 ns-AAAA label
sv: IPv6 addresses for name servers

source: detail web-mail ipv6 ns-AAAA tech table
sv: Name server|IPv6 address|IPv4 address

source: detail web-mail ipv6 ns-AAAA verdict bad
sv: None of the name servers of your domain has an IPv6 address.

source: detail web-mail ipv6 ns-AAAA verdict good
sv: Two or more name servers of your domain have an IPv6 address.

source: detail web-mail ipv6 ns-AAAA verdict other
sv: Only one name server of your domain has an IPv6 address.

source: detail web-mail ipv6 ns-reach exp
sv: We check if all name servers, that have an AAAA record with IPv6 adress, are reachable over IPv6.

source: detail web-mail ipv6 ns-reach label
sv: IPv6 reachability of name servers

source: detail web-mail ipv6 ns-reach tech table
sv: Name server|Unreachable IPv6 address

source: detail web-mail ipv6 ns-reach verdict bad
sv: *Not* all name servers that have an IPv6 address are reachable over IPv6.

source: detail web-mail ipv6 ns-reach verdict good
sv: All name servers that have an IPv6 address are reachable over IPv6.

source: disclosure content
sv: # Responsible disclosure The Internet Standards Platform thinks the security of the Internet.nl website is very important. Despite the care we have taken to ensure security, an existing vulnerability may be found or a new one may arise somehow. Have you found a security flaw in the Internet.nl website? You might have accidentally run across one in the normal operation of this site, or perhaps you have been actively trying to find a vulnerability. In either case, please let us know, so we can take action as soon as possible. By the way, this is **not** an invitation to extensively scan and test our site for weaknesses. We are doing this ourselves. We would like to work with you to further improve the security of our website. We will always take your notifications seriously and will look into any suspected vulnerabilities. ## In return we ask you to: - mail your findings to [question@internet.nl](mailto:question@internet.nl) as soon as possible; - preferably encrypt your e-mail with our PGP key; - provide sufficient information to replicate the problem, so we can fix it as soon as possible; the IP address or the URL is generally sufficient, along with a description of the vulnerability, but for more complex vulnerabilities we may need more information; - not run tests that attack via physical security, social engineering, or third-party applications; - not run brute force or denial of service attacks; - not exploit the vulnerability to, for example, change or delete data, or install malware; - not share the problem with others until we have fixed it; - not copy data from our systems, other than what&#39;s absolutely necessary to demonstrate the leak; - leave your contact data (e-mail address and phone number), so we can get in touch and work with you to fix the problem. ## We promise: - to respond to your notification within three working days, with an evaluation of your report and an expected date for a solution; - to treat your report confidentially: we will not share your personal information without your consent, except to the police and the judiciary if a police report is made or if this information is legally required; - to keep you informed of our progress in solving the problem; - to include your name as the discoverer of the vulnerability in any news reports, if you wish; - that an accidental discovery of a vulnerability will not lead to legal charges against you, as long as you play by the rules and act in the spirit of responsible disclosure; - as a token of our gratitude, we will give you a t-shirt for each report of a problem not yet known to us; we know this is not a big reward, but we do not want to stimulate active scanning for vulnerabilities.

source: domain pagetitle
sv: Website test:

source: domain title
sv: Website test: {{prettyaddr}}

source: domain tweetmessage
sv: The%20website%20{{report.domain}}%20scores%20{{score}}%25%20in%20the%20website%20test%20of%20%40Internet_nl%3A

source: faqs appsecpriv content
sv: ## X-Frame-Options - [RFC 7034: HTTP Header Field X-Frame-Options](https://tools.ietf.org/html/rfc7034) - [X-Frame-Options, MDN webdocs](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Frame-Options) ## X-Content-Type-Options - [Blog 'IE8 Security Part VI: Beta 2 Update'](https://blogs.msdn.microsoft.com/ie/2008/09/02/ie8-security-part-vi-beta-2-update/) - [X-Content-Type-Options, MDN webdocs](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-Content-Type-Options) ## X-XSS-Protection - [Blog 'IE8 Security Part IV: The XSS Filter'](https://blogs.msdn.microsoft.com/ie/2008/07/02/ie8-security-part-iv-the-xss-filter/) - [X-XSS-Protection, MDN webdocs](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/X-XSS-Protection) ## Content-Security-Policy (CSP): - [Content Security Policy Level 2, W3C](https://www.w3.org/TR/CSP2/) - [MDN webdocs on Content-Security-Policy](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Content-Security-Policy) - [Mozilla's Laboratory (Content Security Policy / CSP Toolkit)](https://addons.mozilla.org/nl/firefox/addon/laboratory-by-mozilla/) ## Referrer-Policy - [Referrer Policy, W3C](https://www.w3.org/TR/referrer-policy/) - [Referrer-Policy, MDN webdocs](https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Referrer-Policy)

source: faqs appsecpriv title
sv: Application security options (Security options)
