Repository: pawal/ipv6.cool
Catalog: translations/*/main.po
Languages: sv

source: detail mail dnssec mx-exists exp
sv: We check if the domains of your mail servers (MX) are DNSSEC signed. With a DNSSEC signature senders who validate domain signatures can verify the authenticity of the DNS reply containing the IP addresses and DANE records of your mailserver(s). This prevents an attacker from manipulating the DNS answer in order to redirect mails sent to you to an IP address controlled by the attacker or to eavesdrop on the secured mail server connection. If a domain redirects to another domain via `CNAME`, then we also check if the CNAME domain is signed (which is conformant with the DNSSEC standard). If the CNAME domain is not signed, the result of this subtest will be negative. Note: the validity of the signature is not part of this subtest, but part of the next subtest.

source: detail mail dnssec mx-exists label
sv: DNSSEC existence

source: detail mail dnssec mx-exists tech table
sv: Domain of mail server (MX)|DNSSEC existent

source: detail mail dnssec mx-exists verdict bad
sv: At least one of your mail server domains is insecure, because it is *not* DNSSEC signed.

source: detail mail dnssec mx-exists verdict good
sv: All your mail server domains are DNSSEC signed.

source: detail mail dnssec mx-exists verdict no-mailservers
sv: No mail servers are set on your domain. The test does not fall back to A/AAAA records for mail servers in case of absence of an MX record.

source: detail mail dnssec mx-exists verdict resolver-error
sv: Unfortunately an error occurred in Internet.nl's resolver. Please [contact](/about/) us.

source: detail mail dnssec mx-exists verdict servfail
sv: The name servers of at least one of your mail server domains are *broken*. They returned an error (`SERVFAIL`) to our queries for a DNSSEC signature. Please contact your name server operator (often your mail provider) to fix this soon.

source: detail mail dnssec mx-valid exp
sv: We check if the domains of your receiving mail servers (MX) are signed with a valid signature making them 'secure'. If a domain redirects to another signed domain via `CNAME`, then we also check if the signature of the CNAME domain is valid (which is conformant with the DNSSEC standard). If the signature of the CNAME domain is not valid, the result of this subtest will be negative.

source: detail mail dnssec mx-valid label
sv: DNSSEC validity

source: detail mail dnssec mx-valid tech table
sv: Domain of mail server (MX)|Status

source: detail mail dnssec mx-valid verdict bad
sv: At least one of your signed mail server domains is 'bogus', because its DNSSEC signature is not valid. Either someone manipulated the responses from its name servers, or your mail server domain has serious DNSSEC configuration errors. The latter makes your receiving mail server unreachable for any sending mail server that validates DNSSEC signatures. You should contact the name server operator (often your mail provider) as soon as possible.

source: detail mail dnssec mx-valid verdict good
sv: All your signed mail server domains are secure, because their DNSSEC signatures are valid.

source: detail mail dnssec mx-valid verdict unsupported-ds-algo
sv: At least one of your mail server domains is signed with an algorithm that our validating resolver currently does not support. Therefore we are not able to check the validity of its DNSSEC signature.

source: detail mail dnssec valid exp
sv: We check if your domain is signed with a valid signature making it 'secure'. If a domain redirects to another signed domain via `CNAME`, then we also check if the signature of the CNAME domain is valid (which is conformant with the DNSSEC standard). If the signature of the CNAME domain is not valid, the result of this subtest will be negative.

source: detail mail dnssec valid label
sv: DNSSEC validity

source: detail mail dnssec valid tech table
sv: Email address domain|Status

source: detail mail dnssec valid verdict bad
sv: Your email address domain is 'bogus', because the DNSSEC signature is *not* valid. Either someone manipulated the response from your name server, or your domain has a *serious DNSSEC configuration error*. The latter makes your domain unreachable for any user who validates DNSSEC signatures. You should contact your name server operator (often your registrar or hosting provider) as soon as possible.

source: detail mail dnssec valid verdict good
sv: Your email address domain is secure, because its DNSSEC signature is valid.

source: detail mail dnssec valid verdict unsupported-ds-algo
sv: Your email address domain is signed with an algorithm that our validating resolver currently does not support. Therefore we are not able to check the validity of its DNSSEC signature.

source: detail mail ipv6 mx-AAAA exp
sv: We check if there is at least one AAAA record with IPv6 address for every receiving mail server (MX). In case no mail server is defined, we give a notification and we execute other subtests of the mail test that are still relevant.

source: detail mail ipv6 mx-AAAA label
sv: IPv6 addresses for mail server(s)

source: detail mail ipv6 mx-AAAA tech table
sv: Mail server (MX)|IPv6 address|IPv4 address

source: detail mail ipv6 mx-AAAA verdict bad
sv: At least one receiving mail server on your domain does *not* have an IPv6 address.

source: detail mail ipv6 mx-AAAA verdict good
sv: All receiving mail servers on your domain have an IPv6 address.

source: detail mail ipv6 mx-AAAA verdict other
sv: No mail servers are set on your domain. The test does not fall back to A/AAAA records for mail servers in case of absence of an MX record.

source: detail mail ipv6 mx-reach exp
sv: We check if we can connect to your mail servers (MX) over IPv6 on port 25. We test all IPv6 addresses that we receive from the name servers of your mail server domain(s). A partial score will be given if not all IPv6 addresses are reachable. If an IPv6 address is (syntactically) invalid, we consider it unreachable.

source: detail mail ipv6 mx-reach label
sv: IPv6 reachability of mail server(s)

source: detail mail ipv6 mx-reach tech table
sv: Mail server (MX)|Unreachable IPv6 address

source: detail mail ipv6 mx-reach verdict bad
sv: At least one of your receiving mail servers with an IPv6 address is *not* reachable over IPv6.

source: detail mail ipv6 mx-reach verdict good
sv: All your receiving mail servers with an IPv6 address are reachable over IPv6.

source: detail mail tls cert-hostmatch exp
sv: We check if the domain name of each of your receiving mail servers (MX) matches the domain name on the presented certificates. Sending mail servers usually ignore the domain in the certificate. Without DNSSEC the lookup of the mail server domain is vulnerable to manipulation. Thus matching the domain on the certificate against the mail server domain does not add any authenticity value. Quite a few receiving mail servers are therefore using self-signed certificates, often issued by an internal (private) certificate authority. For authenticity a mail server should use DNSSEC and DANE. A certificate with a domain that matches the domain of the mail server is only required when DANE 'trust anchor assertion' (DANE-TA, 2) is used. See ['IT Security Guidelines for Transport Layer Security (TLS) v2.0'](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) from NCSC-NL, guideline B3-1 (in English). *Requirement level: Optional / Required (only when DANE-TA is used)*

source: detail mail tls cert-hostmatch label
sv: Domain name on certificate

source: detail mail tls cert-hostmatch tech table
sv: Mail server (MX)|Unmatched domains on certificate

source: detail mail tls cert-hostmatch verdict bad
sv: The domain name of at least one of your mail servers does *not* match the domain name on the mail server certificate.

source: detail mail tls cert-hostmatch verdict good
sv: The domain names of all your mail servers match the domain names on your mail server certificates.

source: detail mail tls cert-pubkey exp
sv: We check if the (ECDSA or RSA) digital signature of each of your mail server certificates uses secure parameters. The verification of certificates makes use of digital signatures. To guarantee the authenticity of a connection, a trustworthy algorithm for certificate verification must be used. The algorithm that is used to sign a certificate is selected by its supplier. The certificate specifies the algorithm for digital signatures that is used by its owner during the key exchange. It is possible to configure multiple certificates to support more than one algorithm. The security of ECDSA digital signatures depends on the chosen curve. The security of RSA for encryption and digital signatures is tied to the key length of the public key. See ['IT Security Guidelines for Transport Layer Security (TLS) v2.0'](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) from NCSC-NL, guideline B5-1 and table 9 for ECDSA, and guideline B3-3 and table 8 for RSA (in English). --- **Elliptic curves for ECDSA** * Good: `secp384r1`, `secp256r1`, `x448`, and `x25519` * Phase out: `secp224r1` * Insufficient: Other curves **Length of RSA-keys** * Good: At least 3072 bit * Sufficient: 2048 – 3071 bit * Insufficient: Less than 2048 bit

source: detail mail tls cert-pubkey label
sv: Public key of certificate

source: detail mail tls cert-pubkey tech table
sv: Mail server (MX)|Affected signature parameters|Status

source: detail mail tls cert-pubkey verdict bad
sv: The digital signature of at least one of your mail server certificates uses *insufficiently* secure parameters.

source: detail mail tls cert-pubkey verdict good
sv: The digital signatures of all your mail server certificates use secure parameters.

source: detail mail tls cert-pubkey verdict phase-out
sv: The digital signature of at least one of your mail server certificates uses parameters that have a *phase out* status, because they are known to be fragile and are at risk of of becoming *insufficiently* secure.

source: detail mail tls cert-signature exp
sv: We check if the signed fingerprint of each of your mail server certificates was created with a secure hashing algorithm. See ['IT Security Guidelines for Transport Layer Security (TLS) v2.0'](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) from NCSC-NL, guideline B3-2 and table 3 (in English). --- **Hash functions for certificate verification** * Good: SHA-512, SHA-384, SHA-256 * Insufficient: SHA-1, MD5

source: detail mail tls cert-signature label
sv: Signature of certificate

source: detail mail tls cert-signature tech table
sv: Mail server (MX)|Affected hash algorithm|Status

source: detail mail tls cert-signature verdict bad
sv: At least one of your mail server certificates is signed using a hash algorithm that is *insufficiently* secure.

source: detail mail tls cert-signature verdict good
sv: All your mail server certificates are signed using a secure hash algorithm.

source: detail mail tls cert-trust exp
sv: We check if we are able to build a valid chain of trust for your mail server certificates. For a valid chain of trust, your certificate must be published by a [publicly trusted certificate authority](https://www.mozilla.org/en-US/about/governance/policies/security-group/certs/), and your receiving mail server must present all necessary intermediate certificates. Sending mail servers usually ignore whether a mail server certificate is issued by a publicly trusted certificate authority. Without DNSSEC the lookup of the mail server domain is vulnerable to manipulation. Thus a certificate issued by a publicly trusted certificate authority cannot add any authenticity value. Quite a few receiving mail servers are therefore using self-signed certificates, often issued by an internal (private) certificate authority. For authenticity a mail server should use DNSSEC and DANE. See ['IT Security Guidelines for Transport Layer Security (TLS)'](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) from NCSC-NL, guideline B3-4 (in English). *Requirement level: Optional*

source: detail mail tls cert-trust label
sv: Trust chain of certificate

source: detail mail tls cert-trust tech table
sv: Mail server (MX)|Untrusted certificate chain

source: detail mail tls cert-trust verdict bad
sv: The trust chain of at least one of your mail server certificates is *not* complete and/or *not* signed by a trusted root certificate authority.

source: detail mail tls cert-trust verdict good
sv: The trust chain of all your mail server certificates is complete and signed by a trusted root certificate authority.

source: detail mail tls cipher-order exp
sv: We check if your receiving mail servers (MX) enforce their own cipher preference ('I'), and offer ciphers in accordance with the prescribed ordering ('II'). If your mail servers support 'Good' ciphers only, this test is not applicable as the ordering has no significant security advantage. I. *Server enforced cipher preference*: The receiving mail servers enforce their own cipher preference while negotiating with sending mail servers, and do not accept any preference of the sending mail servers. (*requirement level: Required*); II. *Prescribed ordering*: Ciphers are offered by the receiving mail server in accordance with the below prescribed order in which safe and fast ciphers are preferred. A. Prefer 'Good' over 'Sufficient' over 'Phase out' ciphers (*requirement level: Required*); B. Within a particular security level, proceed as follows: 1. Ciphers that perform key exchange based on elliptic curves are preferred over those that use finite fields. Both are preferred over ciphers that use a static key exchange (*requirement level: Recommended*); 2. Ciphers that do bulk encryption based on AEAD algorithms are preferred over alternatives (*requirement level: Recommended*); 3. Ciphers that do certificate verification based on ECDSA are preferred over RSA (*requirement level: Recommended*); 4. Ciphers are preferred in descending order of their key and then hash size (*requirement level: Recommended*); 5. AES-256 is preferred over ChaCha20 (*requirement level: Optional*). In the above table with technical details **only the first found out of prescribed order algorithm selections** are listed, with the violated prescribed ordering rule shown next to it. See ['IT Security Guidelines for Transport Layer Security (TLS)'](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) from NCSC-NL, guideline B2-5.

source: detail mail tls cipher-order label
sv: Cipher order

source: detail mail tls cipher-order tech table
sv: Mail server (MX)|First found affected cipher pair|Violated rule # ('II-B')

source: detail mail tls cipher-order verdict bad
sv: At least one of your mailservers does *not* enforce its own cipher preference ('I').

source: detail mail tls cipher-order verdict good
sv: All your mail servers enforce their own cipher preference ('I'), and offer ciphers in accordance with the prescribed ordering ('II').

source: detail mail tls cipher-order verdict na
sv: This subtest is not applicable as your mail server supports 'Good' ciphers only.

source: detail mail tls cipher-order verdict seclevel-bad
sv: At least one of your mail servers does not prefer 'Good' over 'Sufficient' over 'Phase out' ciphers ('II-A').

source: detail mail tls cipher-order verdict warning
sv: At least one of your mail servers does *not* offer ciphers in accordance with the prescribed ordering within a particular security level ('II-B').

source: detail mail tls ciphers exp
sv: We check if your receiving mail servers (MX) support secure ciphers (algorithm selections) only. To prevent us from running into rate limits of receiving mail servers, the test result only contains the **first found affected algorithm selections**. An algorithm selection consists of ciphers for four cryptographic functions: 1) key exchange, 2) certificate verification, 3) bulk encryption, and 4) hashing. A web server may support more than one algorithm selection. * Since TLS 1.3, the term 'cipher suite' only comprises ciphers used for bulk encryption and hashing. When using TLS 1.3 the ciphers for key exchange and certificate verification are negotiable and not part of the naming of the cipher suite. Because this makes the term 'cipher suite' ambiguous, NCSC-NL uses the term 'algorithm selection' to comprise all four cipher functions. * NCSC-NL uses the [IANA naming convention](https://www.iana.org/assignments/tls-parameters/tls-parameters.xhtml#tls-parameters-4) for algorithm selections. Internet.nl uses the [OpenSSL naming convention](https://www.openssl.org/docs/manmaster/man1/openssl-ciphers.html#CIPHER-SUITE-NAMES). Since TLS 1.3 OpenSSL follows the IANA naming convention. A translation between both can be found in the OpenSSL documentation. See ['IT Security Guidelines for Transport Layer Security (TLS)'](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) from NCSC-NL, guideline B2-1 to B2-4 and table 2, 4, 6 and 7 (in English). --- Below you find 'Good', 'Sufficient' and 'Phase out' algorithm selections in the by NCSC-NL prescibed order, based on appendix C of the 'IT Security Guidelines for Transport Layer Security (TLS)'. Behind every algorithm selection is the minimum TLS version (e.g. [1.2]) that supports this algorithm selection and that is at least 'Phase out'. Good: * `ECDHE-ECDSA-AES256-GCM-SHA384` (`TLS_AES_256_GCM_SHA384` in 1.3) [1.2] * `ECDHE-ECDSA-CHACHA20-POLY1305` (`TLS_CHACHA20_POLY1305_SHA256` in 1.3) [1.2] * `ECDHE-ECDSA-AES128-GCM-SHA256` (`TLS_AES_128_GCM_SHA256` in 1.3) [1.2] * `ECDHE-RSA-AES256-GCM-SHA384` (`TLS_AES_256_GCM_SHA384` in 1.3) [1.2] * `ECDHE-RSA-CHACHA20-POLY1305` (`TLS_CHACHA20_POLY1305_SHA256` in 1.3) [1.2] * `ECDHE-RSA-AES128-GCM-SHA256` (`TLS_AES_128_GCM_SHA256` in 1.3) [1.2] Sufficient: * `ECDHE-ECDSA-AES256-SHA384` [1.2] * `ECDHE-ECDSA-AES256-SHA` [1.0] * `ECDHE-ECDSA-AES128-SHA256` [1.2] * `ECDHE-ECDSA-AES128-SHA` [1.0] * `ECDHE-RSA-AES256-SHA384` [1.2] * `ECDHE-RSA-AES256-SHA` [1.0] * `ECDHE-RSA-AES128-SHA256` [1.2] * `ECDHE-RSA-AES128-SHA` [1.0] * `DHE-RSA-AES256-GCM-SHA384` [1.2] * `DHE-RSA-CHACHA20-POLY1305` [1.2] * `DHE-RSA-AES128-GCM-SHA256` [1.2] * `DHE-RSA-AES256-SHA256` [1.2] * `DHE-RSA-AES256-SHA` [1.0] * `DHE-RSA-AES128-SHA256` [1.2] * `DHE-RSA-AES128-SHA` [1.0] Phase out: * `ECDHE-ECDSA-DES-CBC3-SHA` [1.0] * `ECDHE-RSA-DES-CBC3-SHA` [1.0] * `DHE-RSA-DES-CBC3-SHA` [1.0] * `AES256-GCM-SHA384` [1.2] * `AES128-GCM-SHA256` [1.2] * `AES256-SHA256` [1.2] * `AES256-SHA` [1.0] * `AES128-SHA256` [1.2] * `AES128-SHA` [1.0] * `DES-CBC3-SHA` [1.0]

source: detail mail tls ciphers label
sv: Ciphers (Algorithm selections)

source: detail mail tls ciphers tech table
sv: Mail server (MX)|First found affected cipher|Status

source: detail mail tls ciphers verdict bad
sv: At least one of your mail servers supports one or more *insufficiently* secure ciphers.

source: detail mail tls ciphers verdict good
sv: All your mail servers support secure ciphers only.

source: detail mail tls ciphers verdict phase-out
sv: At least one of your mail servers supports one or more ciphers that have a *phase out* status, because they are known to be fragile and are at risk of becoming *insufficiently* secure.

source: detail mail tls compression exp
sv: We check if your receiving mail servers (MX) support TLS compression. The use of compression can give an attacker information about the secret parts of encrypted communication. An attacker that can determine or control parts of the data sent can reconstruct the original data by performing a large number of requests. TLS compression is used so rarely that disabling it is generally not a problem. See ['IT Security Guidelines for Transport Layer Security (TLS)'](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) from NCSC-NL, guideline B7-1 and table 11 (in English).

source: detail mail tls compression label
sv: TLS compression

source: detail mail tls compression tech table
sv: Mail server (MX)|TLS compression

source: detail mail tls compression verdict bad
sv: At least on of your mail servers supports TLS compression, which is *not* secure.

source: detail mail tls compression verdict good
sv: All your mail servers do not support TLS compression.

source: detail mail tls dane-exists exp
sv: We check if the name servers of each of your receiving mail servers (MX) provide a TLSA record for DANE. As DNSSEC is preconditional for DANE, this test will fail in case DNSSEC is missing on the mail server domain(s). Furthermore the test will lead to a fail if there is no DNSSEC proof of 'Denial of Existence' for TLSA records. If a signed TLSA record exists but at the same time there is an insecure `NXDOMAIN` for the same domain (due to faulty signer software), the test will also show a fail. The latter two failure scenario's could lead to non-delivery of emails addressed to you by DANE validating mail senders. See ['IT Security Guidelines for Transport Layer Security (TLS) v2.0'](https://english.ncsc.nl/publications/publications/2019/juni/01/it-security-guidelines-for-transport-layer-security-tls) from NCSC-NL, Appendix A, under 'Certificate pinning and DANE' (in English).

source: detail mail tls dane-exists label
sv: DANE existence

source: detail mail tls dane-exists tech table
sv: Mail server (MX)|DANE TLSA record existent

source: detail mail tls dane-exists verdict bad
sv: At least one of your mail server domains does *not* provide a TLSA record for DANE.

source: detail mail tls dane-exists verdict bogus
sv: At least one of your mail server domains does *not* provide DNSSEC proof that DANE TLSA records do not exist. This could lead to non-deliverability of mail sent to you by DANE validating mail senders. You should ask your name server operator to fix this issue.

source: detail mail tls dane-exists verdict good
sv: All your mail server domains provide a TLSA record for DANE.

source: detail mail tls dane-rollover exp
sv: We check if there is an active DANE scheme to reliably handle certificate rollovers on your receiving mailservers (MX). Such a scheme will be proven useful when there is a need to update your mail server certificate(s). It can prevent that DANE becomes invalid during the transition period which could endanger mail deliverability at your domain. A rollover scheme is not expected to be 'active' all the time. Below you will find *two possible DANE rollover procedures* (source: [slides by Viktor Dukhovni](https://static.ptbl.co/static/attachments/169319/1520904692.pdf)). In each procedure two DANE TLSA records need to be present which is checked by this subtest. *Requirement level: Optional* --- **DANE rollover procedures** *1. Current + Next* - Generate next key when deploying current key and cert - Deploy new chain, and publish new TLSA records: - `_25._tcp.mx.example.com. IN TLSA 3 1 1 curr-pubkey-sha256` - `_25._tcp.mx.example.com. IN TLSA 3 1 1 next-pubkey-sha256` - Weeks later, obtain certiﬁcate for pre-generated next key - But ﬁrst, make sure TLSA record is already in place - Repeat! *2. Current + Issuer CA* - Publish TLSA RRs for server key & issuer CA key: - `_25._tcp.mx.example.com. IN TLSA 3 1 1 ee-pubkey-sha256` - `_25._tcp.mx.example.com. IN TLSA 2 1 1 ta-pubkey-sha256` - Deploy certiﬁcates from same CA, if EE key changes: - Promptly update 3 1 1 hash to match new EE key - If CA key changes, keep same EE key - Obtain cert from new CA - Promptly update 2 1 1 hash to match new CA key
